{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_8", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_8"}, "inbound_nodes": []}, {"name": "input_15", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_15"}, "inbound_nodes": []}, {"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "input_18", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_18"}, "inbound_nodes": []}, {"name": "input_6", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_6"}, "inbound_nodes": []}, {"name": "input_7", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_7"}, "inbound_nodes": []}, {"name": "input_10", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_10"}, "inbound_nodes": []}, {"name": "input_9", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_9"}, "inbound_nodes": []}, {"name": "input_30", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_30"}, "inbound_nodes": []}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "input_11", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_11"}, "inbound_nodes": []}, {"name": "input_17", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_17"}, "inbound_nodes": []}, {"name": "input_13", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_13"}, "inbound_nodes": []}, {"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_4"}, "inbound_nodes": []}, {"name": "input_20", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_20"}, "inbound_nodes": []}, {"name": "input_5", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_5"}, "inbound_nodes": []}, {"name": "input_25", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_25"}, "inbound_nodes": []}, {"name": "input_34", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_34"}, "inbound_nodes": []}, {"name": "input_37", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_37"}, "inbound_nodes": []}, {"name": "input_23", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_23"}, "inbound_nodes": []}, {"name": "input_38", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_38"}, "inbound_nodes": []}, {"name": "input_43", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_43"}, "inbound_nodes": []}, {"name": "input_46", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_46"}, "inbound_nodes": []}, {"name": "input_47", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_47"}, "inbound_nodes": []}, {"name": "input_49", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_49"}, "inbound_nodes": []}, {"name": "input_44", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_44"}, "inbound_nodes": []}, {"name": "input_27", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_27"}, "inbound_nodes": []}, {"name": "input_54", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_54"}, "inbound_nodes": []}, {"name": "dense_8", "class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"name": "dense_15", "class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_15", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dense_18", "class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_18", 0, 0, {}]]]}, {"name": "dense_6", "class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "dense_7", "class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"name": "dense_10", "class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"name": "dense_9", "class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "dense_30", "class_name": "Dense", "config": {"name": "dense_30", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_30", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "dense_11", "class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"name": "dense_17", "class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_17", 0, 0, {}]]]}, {"name": "dense_13", "class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_13", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "dense_20", "class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"name": "dense_25", "class_name": "Dense", "config": {"name": "dense_25", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_25", 0, 0, {}]]]}, {"name": "dense_34", "class_name": "Dense", "config": {"name": "dense_34", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_34", 0, 0, {}]]]}, {"name": "dense_37", "class_name": "Dense", "config": {"name": "dense_37", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_37", 0, 0, {}]]]}, {"name": "dense_23", "class_name": "Dense", "config": {"name": "dense_23", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_23", 0, 0, {}]]]}, {"name": "dense_38", "class_name": "Dense", "config": {"name": "dense_38", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_38", 0, 0, {}]]]}, {"name": "dense_43", "class_name": "Dense", "config": {"name": "dense_43", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_43", 0, 0, {}]]]}, {"name": "dense_46", "class_name": "Dense", "config": {"name": "dense_46", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_46", 0, 0, {}]]]}, {"name": "dense_47", "class_name": "Dense", "config": {"name": "dense_47", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_47", 0, 0, {}]]]}, {"name": "dense_49", "class_name": "Dense", "config": {"name": "dense_49", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_49", 0, 0, {}]]]}, {"name": "dense_44", "class_name": "Dense", "config": {"name": "dense_44", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_44", 0, 0, {}]]]}, {"name": "dense_27", "class_name": "Dense", "config": {"name": "dense_27", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_27", 0, 0, {}]]]}, {"name": "dense_54", "class_name": "Dense", "config": {"name": "dense_54", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_54", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_8", 0, 0, {}], ["dense_15", 0, 0, {}]]]}, {"name": "concatenate_3", "class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_18", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_7", "class_name": "Concatenate", "config": {"name": "concatenate_7", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_9", "class_name": "Concatenate", "config": {"name": "concatenate_9", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_7", 0, 0, {}]]]}, {"name": "input_24", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_24"}, "inbound_nodes": []}, {"name": "input_53", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_53"}, "inbound_nodes": []}, {"name": "concatenate_16", "class_name": "Concatenate", "config": {"name": "concatenate_16", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_9", 0, 0, {}], ["dense_30", 0, 0, {}]]]}, {"name": "concatenate_20", "class_name": "Concatenate", "config": {"name": "concatenate_20", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_3", 0, 0, {}], ["dense_1", 0, 0, {}]]]}, {"name": "concatenate_22", "class_name": "Concatenate", "config": {"name": "concatenate_22", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_3", 0, 0, {}], ["dense_9", 0, 0, {}]]]}, {"name": "concatenate_30", "class_name": "Concatenate", "config": {"name": "concatenate_30", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_3", 0, 0, {}]]]}, {"name": "concatenate_32", "class_name": "Concatenate", "config": {"name": "concatenate_32", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_36", "class_name": "Concatenate", "config": {"name": "concatenate_36", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_9", 0, 0, {}], ["dense_7", 0, 0, {}]]]}, {"name": "concatenate_38", "class_name": "Concatenate", "config": {"name": "concatenate_38", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_30", 0, 0, {}]]]}, {"name": "concatenate_60", "class_name": "Concatenate", "config": {"name": "concatenate_60", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_62", "class_name": "Concatenate", "config": {"name": "concatenate_62", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_1", 0, 0, {}]]]}, {"name": "concatenate_90", "class_name": "Concatenate", "config": {"name": "concatenate_90", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_2", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_92", "class_name": "Concatenate", "config": {"name": "concatenate_92", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_7", 0, 0, {}], ["dense_4", 0, 0, {}]]]}, {"name": "concatenate_96", "class_name": "Concatenate", "config": {"name": "concatenate_96", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_3", 0, 0, {}], ["dense_1", 0, 0, {}]]]}, {"name": "concatenate_98", "class_name": "Concatenate", "config": {"name": "concatenate_98", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_104", "class_name": "Concatenate", "config": {"name": "concatenate_104", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_20", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_106", "class_name": "Concatenate", "config": {"name": "concatenate_106", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "concatenate_110", "class_name": "Concatenate", "config": {"name": "concatenate_110", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_5", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_119", "class_name": "Concatenate", "config": {"name": "concatenate_119", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_1", 0, 0, {}]]]}, {"name": "concatenate_121", "class_name": "Concatenate", "config": {"name": "concatenate_121", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "concatenate_125", "class_name": "Concatenate", "config": {"name": "concatenate_125", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_132", "class_name": "Concatenate", "config": {"name": "concatenate_132", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "concatenate_134", "class_name": "Concatenate", "config": {"name": "concatenate_134", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_5", 0, 0, {}], ["dense_1", 0, 0, {}]]]}, {"name": "concatenate_158", "class_name": "Concatenate", "config": {"name": "concatenate_158", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_17", 0, 0, {}], ["dense_4", 0, 0, {}]]]}, {"name": "concatenate_160", "class_name": "Concatenate", "config": {"name": "concatenate_160", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_25", 0, 0, {}], ["dense_7", 0, 0, {}]]]}, {"name": "concatenate_164", "class_name": "Concatenate", "config": {"name": "concatenate_164", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_34", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "input_36", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_36"}, "inbound_nodes": []}, {"name": "concatenate_166", "class_name": "Concatenate", "config": {"name": "concatenate_166", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_172", "class_name": "Concatenate", "config": {"name": "concatenate_172", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_8", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_174", "class_name": "Concatenate", "config": {"name": "concatenate_174", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_7", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "concatenate_178", "class_name": "Concatenate", "config": {"name": "concatenate_178", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_23", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_180", "class_name": "Concatenate", "config": {"name": "concatenate_180", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "concatenate_188", "class_name": "Concatenate", "config": {"name": "concatenate_188", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_190", "class_name": "Concatenate", "config": {"name": "concatenate_190", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_194", "class_name": "Concatenate", "config": {"name": "concatenate_194", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_196", "class_name": "Concatenate", "config": {"name": "concatenate_196", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_1", 0, 0, {}]]]}, {"name": "concatenate_202", "class_name": "Concatenate", "config": {"name": "concatenate_202", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "concatenate_204", "class_name": "Concatenate", "config": {"name": "concatenate_204", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_38", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_208", "class_name": "Concatenate", "config": {"name": "concatenate_208", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_5", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_210", "class_name": "Concatenate", "config": {"name": "concatenate_210", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_13", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_220", "class_name": "Concatenate", "config": {"name": "concatenate_220", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_3", 0, 0, {}], ["dense_1", 0, 0, {}]]]}, {"name": "concatenate_222", "class_name": "Concatenate", "config": {"name": "concatenate_222", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_9", 0, 0, {}], ["dense_3", 0, 0, {}]]]}, {"name": "concatenate_226", "class_name": "Concatenate", "config": {"name": "concatenate_226", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_2", 0, 0, {}]]]}, {"name": "concatenate_232", "class_name": "Concatenate", "config": {"name": "concatenate_232", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_1", 0, 0, {}]]]}, {"name": "concatenate_234", "class_name": "Concatenate", "config": {"name": "concatenate_234", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "concatenate_238", "class_name": "Concatenate", "config": {"name": "concatenate_238", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "concatenate_247", "class_name": "Concatenate", "config": {"name": "concatenate_247", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_252", "class_name": "Concatenate", "config": {"name": "concatenate_252", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_254", "class_name": "Concatenate", "config": {"name": "concatenate_254", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_284", "class_name": "Concatenate", "config": {"name": "concatenate_284", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_8", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "concatenate_286", "class_name": "Concatenate", "config": {"name": "concatenate_286", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_3", 0, 0, {}], ["dense_4", 0, 0, {}]]]}, {"name": "concatenate_290", "class_name": "Concatenate", "config": {"name": "concatenate_290", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_8", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "concatenate_292", "class_name": "Concatenate", "config": {"name": "concatenate_292", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_4", 0, 0, {}]]]}, {"name": "concatenate_299", "class_name": "Concatenate", "config": {"name": "concatenate_299", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_7", 0, 0, {}], ["dense_2", 0, 0, {}]]]}, {"name": "concatenate_304", "class_name": "Concatenate", "config": {"name": "concatenate_304", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_3", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_321", "class_name": "Concatenate", "config": {"name": "concatenate_321", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_3", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_323", "class_name": "Concatenate", "config": {"name": "concatenate_323", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_8", 0, 0, {}]]]}, {"name": "concatenate_331", "class_name": "Concatenate", "config": {"name": "concatenate_331", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_2", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "concatenate_333", "class_name": "Concatenate", "config": {"name": "concatenate_333", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_2", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_342", "class_name": "Concatenate", "config": {"name": "concatenate_342", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_9", 0, 0, {}], ["dense_4", 0, 0, {}]]]}, {"name": "concatenate_344", "class_name": "Concatenate", "config": {"name": "concatenate_344", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_4", 0, 0, {}]]]}, {"name": "concatenate_363", "class_name": "Concatenate", "config": {"name": "concatenate_363", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "input_45", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_45"}, "inbound_nodes": []}, {"name": "concatenate_365", "class_name": "Concatenate", "config": {"name": "concatenate_365", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_369", "class_name": "Concatenate", "config": {"name": "concatenate_369", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_371", "class_name": "Concatenate", "config": {"name": "concatenate_371", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_9", 0, 0, {}]]]}, {"name": "concatenate_379", "class_name": "Concatenate", "config": {"name": "concatenate_379", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_8", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_381", "class_name": "Concatenate", "config": {"name": "concatenate_381", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_385", "class_name": "Concatenate", "config": {"name": "concatenate_385", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_387", "class_name": "Concatenate", "config": {"name": "concatenate_387", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_9", 0, 0, {}], ["dense_8", 0, 0, {}]]]}, {"name": "concatenate_404", "class_name": "Concatenate", "config": {"name": "concatenate_404", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_43", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_406", "class_name": "Concatenate", "config": {"name": "concatenate_406", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "concatenate_410", "class_name": "Concatenate", "config": {"name": "concatenate_410", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_412", "class_name": "Concatenate", "config": {"name": "concatenate_412", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_9", 0, 0, {}]]]}, {"name": "concatenate_421", "class_name": "Concatenate", "config": {"name": "concatenate_421", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_5", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_430", "class_name": "Concatenate", "config": {"name": "concatenate_430", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_46", 0, 0, {}], ["dense_49", 0, 0, {}]]]}, {"name": "concatenate_432", "class_name": "Concatenate", "config": {"name": "concatenate_432", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "input_52", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_52"}, "inbound_nodes": []}, {"name": "concatenate_436", "class_name": "Concatenate", "config": {"name": "concatenate_436", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_5", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_438", "class_name": "Concatenate", "config": {"name": "concatenate_438", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_444", "class_name": "Concatenate", "config": {"name": "concatenate_444", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_9", 0, 0, {}]]]}, {"name": "concatenate_446", "class_name": "Concatenate", "config": {"name": "concatenate_446", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_450", "class_name": "Concatenate", "config": {"name": "concatenate_450", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_7", 0, 0, {}]]]}, {"name": "concatenate_452", "class_name": "Concatenate", "config": {"name": "concatenate_452", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_3", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "concatenate_464", "class_name": "Concatenate", "config": {"name": "concatenate_464", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_43", 0, 0, {}]]]}, {"name": "concatenate_466", "class_name": "Concatenate", "config": {"name": "concatenate_466", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_3", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_470", "class_name": "Concatenate", "config": {"name": "concatenate_470", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_478", "class_name": "Concatenate", "config": {"name": "concatenate_478", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_4", 0, 0, {}]]]}, {"name": "concatenate_486", "class_name": "Concatenate", "config": {"name": "concatenate_486", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_7", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "concatenate_488", "class_name": "Concatenate", "config": {"name": "concatenate_488", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_492", "class_name": "Concatenate", "config": {"name": "concatenate_492", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_46", 0, 0, {}], ["dense_13", 0, 0, {}]]]}, {"name": "concatenate_494", "class_name": "Concatenate", "config": {"name": "concatenate_494", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_11", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_501", "class_name": "Concatenate", "config": {"name": "concatenate_501", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_5", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_505", "class_name": "Concatenate", "config": {"name": "concatenate_505", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_8", 0, 0, {}]]]}, {"name": "concatenate_507", "class_name": "Concatenate", "config": {"name": "concatenate_507", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_517", "class_name": "Concatenate", "config": {"name": "concatenate_517", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_44", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_521", "class_name": "Concatenate", "config": {"name": "concatenate_521", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_2", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_527", "class_name": "Concatenate", "config": {"name": "concatenate_527", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_529", "class_name": "Concatenate", "config": {"name": "concatenate_529", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_27", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_533", "class_name": "Concatenate", "config": {"name": "concatenate_533", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_535", "class_name": "Concatenate", "config": {"name": "concatenate_535", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_543", "class_name": "Concatenate", "config": {"name": "concatenate_543", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_545", "class_name": "Concatenate", "config": {"name": "concatenate_545", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_7", 0, 0, {}]]]}, {"name": "concatenate_549", "class_name": "Concatenate", "config": {"name": "concatenate_549", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_551", "class_name": "Concatenate", "config": {"name": "concatenate_551", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "concatenate_586", "class_name": "Concatenate", "config": {"name": "concatenate_586", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_3", 0, 0, {}], ["dense_1", 0, 0, {}]]]}, {"name": "concatenate_602", "class_name": "Concatenate", "config": {"name": "concatenate_602", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_5", 0, 0, {}], ["dense_4", 0, 0, {}]]]}, {"name": "concatenate_604", "class_name": "Concatenate", "config": {"name": "concatenate_604", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_5", 0, 0, {}], ["dense_3", 0, 0, {}]]]}, {"name": "concatenate_608", "class_name": "Concatenate", "config": {"name": "concatenate_608", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_610", "class_name": "Concatenate", "config": {"name": "concatenate_610", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_620", "class_name": "Concatenate", "config": {"name": "concatenate_620", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_5", 0, 0, {}], ["dense_7", 0, 0, {}]]]}, {"name": "concatenate_622", "class_name": "Concatenate", "config": {"name": "concatenate_622", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_626", "class_name": "Concatenate", "config": {"name": "concatenate_626", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_2", 0, 0, {}]]]}, {"name": "concatenate_638", "class_name": "Concatenate", "config": {"name": "concatenate_638", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_6", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_643", "class_name": "Concatenate", "config": {"name": "concatenate_643", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_38", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "concatenate_645", "class_name": "Concatenate", "config": {"name": "concatenate_645", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_37", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_661", "class_name": "Concatenate", "config": {"name": "concatenate_661", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_54", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "concatenate_663", "class_name": "Concatenate", "config": {"name": "concatenate_663", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_4", 0, 0, {}]]]}, {"name": "concatenate_667", "class_name": "Concatenate", "config": {"name": "concatenate_667", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_2", 0, 0, {}], ["dense_47", 0, 0, {}]]]}, {"name": "concatenate_669", "class_name": "Concatenate", "config": {"name": "concatenate_669", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_4", 0, 0, {}]]]}, {"name": "concatenate_678", "class_name": "Concatenate", "config": {"name": "concatenate_678", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_8", 0, 0, {}], ["dense_2", 0, 0, {}]]]}, {"name": "concatenate_692", "class_name": "Concatenate", "config": {"name": "concatenate_692", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_47", 0, 0, {}], ["dense_1", 0, 0, {}]]]}, {"name": "concatenate_718", "class_name": "Concatenate", "config": {"name": "concatenate_718", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_9", 0, 0, {}]]]}, {"name": "concatenate_720", "class_name": "Concatenate", "config": {"name": "concatenate_720", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_724", "class_name": "Concatenate", "config": {"name": "concatenate_724", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "concatenate_726", "class_name": "Concatenate", "config": {"name": "concatenate_726", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "dense_55", "class_name": "Dense", "config": {"name": "dense_55", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "dense_57", "class_name": "Dense", "config": {"name": "dense_57", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "dense_61", "class_name": "Dense", "config": {"name": "dense_61", "trainable": true, "dtype": 