{"class_name": "Model", "config": {"name": "model_4", "layers": [{"name": "input_15", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_15"}, "inbound_nodes": []}, {"name": "dense_308", "class_name": "Dense", "config": {"name": "dense_308", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_15", 0, 0, {}]]]}, {"name": "input_19", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_19"}, "inbound_nodes": []}, {"name": "input_17", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_17"}, "inbound_nodes": []}, {"name": "concatenate_342", "class_name": "Concatenate", "config": {"name": "concatenate_342", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_308", 0, 0, {}], ["dense_308", 0, 0, {}]]]}, {"name": "dense_312", "class_name": "Dense", "config": {"name": "dense_312", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_19", 0, 0, {}]]]}, {"name": "dense_310", "class_name": "Dense", "config": {"name": "dense_310", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_17", 0, 0, {}]]]}, {"name": "dense_368", "class_name": "Dense", "config": {"name": "dense_368", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_342", 0, 0, {}]]]}, {"name": "input_22", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_22"}, "inbound_nodes": []}, {"name": "concatenate_301", "class_name": "Concatenate", "config": {"name": "concatenate_301", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_312", 0, 0, {}], ["dense_310", 0, 0, {}]]]}, {"name": "concatenate_343", "class_name": "Concatenate", "config": {"name": "concatenate_343", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_310", 0, 0, {}], ["dense_368", 0, 0, {}]]]}, {"name": "dense_315", "class_name": "Dense", "config": {"name": "dense_315", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_22", 0, 0, {}]]]}, {"name": "dense_327", "class_name": "Dense", "config": {"name": "dense_327", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_301", 0, 0, {}]]]}, {"name": "dense_369", "class_name": "Dense", "config": {"name": "dense_369", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_343", 0, 0, {}]]]}, {"name": "concatenate_302", "class_name": "Concatenate", "config": {"name": "concatenate_302", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_327", 0, 0, {}], ["dense_315", 0, 0, {}]]]}, {"name": "concatenate_329", "class_name": "Concatenate", "config": {"name": "concatenate_329", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_312", 0, 0, {}], ["dense_308", 0, 0, {}]]]}, {"name": "concatenate_334", "class_name": "Concatenate", "config": {"name": "concatenate_334", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_308", 0, 0, {}], ["dense_308", 0, 0, {}]]]}, {"name": "concatenate_335", "class_name": "Concatenate", "config": {"name": "concatenate_335", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_308", 0, 0, {}], ["dense_312", 0, 0, {}]]]}, {"name": "concatenate_344", "class_name": "Concatenate", "config": {"name": "concatenate_344", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_369", 0, 0, {}], ["dense_315", 0, 0, {}]]]}, {"name": "dense_328", "class_name": "Dense", "config": {"name": "dense_328", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_302", 0, 0, {}]]]}, {"name": "dense_355", "class_name": "Dense", "config": {"name": "dense_355", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_329", 0, 0, {}]]]}, {"name": "dense_360", "class_name": "Dense", "config": {"name": "dense_360", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_334", 0, 0, {}]]]}, {"name": "dense_361", "class_name": "Dense", "config": {"name": "dense_361", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_335", 0, 0, {}]]]}, {"name": "dense_370", "class_name": "Dense", "config": {"name": "dense_370", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_344", 0, 0, {}]]]}, {"name": "input_18", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_18"}, "inbound_nodes": []}, {"name": "concatenate_303", "class_name": "Concatenate", "config": {"name": "concatenate_303", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_328", 0, 0, {}], ["dense_315", 0, 0, {}]]]}, {"name": "input_13", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_13"}, "inbound_nodes": []}, {"name": "concatenate_318", "class_name": "Concatenate", "config": {"name": "concatenate_318", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_312", 0, 0, {}], ["dense_310", 0, 0, {}]]]}, {"name": "concatenate_321", "class_name": "Concatenate", "config": {"name": "concatenate_321", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_312", 0, 0, {}], ["dense_315", 0, 0, {}]]]}, {"name": "concatenate_330", "class_name": "Concatenate", "config": {"name": "concatenate_330", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_355", 0, 0, {}], ["dense_315", 0, 0, {}]]]}, {"name": "concatenate_336", "class_name": "Concatenate", "config": {"name": "concatenate_336", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_360", 0, 0, {}], ["dense_361", 0, 0, {}]]]}, {"name": "concatenate_345", "class_name": "Concatenate", "config": {"name": "concatenate_345", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_370", 0, 0, {}], ["dense_310", 0, 0, {}]]]}, {"name": "dense_311", "class_name": "Dense", "config": {"name": "dense_311", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_18", 0, 0, {}]]]}, {"name": "dense_329", "class_name": "Dense", "config": {"name": "dense_329", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_303", 0, 0, {}]]]}, {"name": "dense_306", "class_name": "Dense", "config": {"name": "dense_306", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_13", 0, 0, {}]]]}, {"name": "dense_344", "class_name": "Dense", "config": {"name": "dense_344", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_318", 0, 0, {}]]]}, {"name": "dense_347", "class_name": "Dense", "config": {"name": "dense_347", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_321", 0, 0, {}]]]}, {"name": "dense_356", "class_name": "Dense", "config": {"name": "dense_356", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_330", 0, 0, {}]]]}, {"name": "dense_362", "class_name": "Dense", "config": {"name": "dense_362", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_336", 0, 0, {}]]]}, {"name": "dense_371", "class_name": "Dense", "config": {"name": "dense_371", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_345", 0, 0, {}]]]}, {"name": "concatenate_304", "class_name": "Concatenate", "config": {"name": "concatenate_304", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_329", 0, 0, {}], ["dense_306", 0, 0, {}]]]}, {"name": "concatenate_319", "class_name": "Concatenate", "config": {"name": "concatenate_319", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_344", 0, 0, {}], ["dense_315", 0, 0, {}]]]}, {"name": "concatenate_322", "class_name": "Concatenate", "config": {"name": "concatenate_322", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_308", 0, 0, {}], ["dense_347", 0, 0, {}]]]}, {"name": "concatenate_331", "class_name": "Concatenate", "config": {"name": "concatenate_331", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_356", 0, 0, {}], ["dense_315", 0, 0, {}]]]}, {"name": "concatenate_337", "class_name": "Concatenate", "config": {"name": "concatenate_337", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_362", 0, 0, {}], ["dense_310", 0, 0, {}]]]}, {"name": "concatenate_346", "class_name": "Concatenate", "config": {"name": "concatenate_346", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_371", 0, 0, {}], ["dense_311", 0, 0, {}]]]}, {"name": "concatenate_372", "class_name": "Concatenate", "config": {"name": "concatenate_372", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_308", 0, 0, {}], ["dense_312", 0, 0, {}]]]}, {"name": "concatenate_379", "class_name": "Concatenate", "config": {"name": "concatenate_379", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_308", 0, 0, {}], ["dense_310", 0, 0, {}]]]}, {"name": "dense_330", "class_name": "Dense", "config": {"name": "dense_330", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_304", 0, 0, {}]]]}, {"name": "dense_345", "class_name": "Dense", "config": {"name": "dense_345", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_319", 0, 0, {}]]]}, {"name": "dense_348", "class_name": "Dense", "config": {"name": "dense_348", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_322", 0, 0, {}]]]}, {"name": "dense_357", "class_name": "Dense", "config": {"name": "dense_357", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_331", 0, 0, {}]]]}, {"name": "dense_363", "class_name": "Dense", "config": {"name": "dense_363", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_337", 0, 0, {}]]]}, {"name": "dense_372", "class_name": "Dense", "config": {"name": "dense_372", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_346", 0, 0, {}]]]}, {"name": "dense_398", "class_name": "Dense", "config": {"name": "dense_398", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_372", 0, 0, {}]]]}, {"name": "dense_405", "class_name": "Dense", "config": {"name": "dense_405", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_379", 0, 0, {}]]]}, {"name": "concatenate_291", "class_name": "Concatenate", "config": {"name": "concatenate_291", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_312", 0, 0, {}], ["dense_315", 0, 0, {}]]]}, {"name": "concatenate_305", "class_name": "Concatenate", "config": {"name": "concatenate_305", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_330", 0, 0, {}], ["dense_308", 0, 0, {}]]]}, {"name": "concatenate_306", "class_name": "Concatenate", "config": {"name": "concatenate_306", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_308", 0, 0, {}], ["dense_315", 0, 0, {}]]]}, {"name": "concatenate_320", "class_name": "Concatenate", "config": {"name": "concatenate_320", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_308", 0, 0, {}], ["dense_345", 0, 0, {}]]]}, {"name": "concatenate_323", "class_name": "Concatenate", "config": {"name": "concatenate_323", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_348", 0, 0, {}], ["dense_315", 0, 0, {}]]]}, {"name": "concatenate_332", "class_name": "Concatenate", "config": {"name": "concatenate_332", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_357", 0, 0, {}], ["dense_308", 0, 0, {}]]]}, {"name": "concatenate_338", "class_name": "Concatenate", "config": {"name": "concatenate_338", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_363", 0, 0, {}], ["dense_315", 0, 0, {}]]]}, {"name": "concatenate_347", "class_name": "Concatenate", "config": {"name": "concatenate_347", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_372", 0, 0, {}], ["dense_310", 0, 0, {}]]]}, {"name": "concatenate_373", "class_name": "Concatenate", "config": {"name": "concatenate_373", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_312", 0, 0, {}], ["dense_398", 0, 0, {}]]]}, {"name": "concatenate_374", "class_name": "Concatenate", "config": {"name": "concatenate_374", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_310", 0, 0, {}], ["dense_315", 0, 0, {}]]]}, {"name": "concatenate_380", "class_name": "Concatenate", "config": {"name": "concatenate_380", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_310", 0, 0, {}], ["dense_405", 0, 0, {}]]]}, {"name": "concatenate_422", "class_name": "Concatenate", "config": {"name": "concatenate_422", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_312", 0, 0, {}], ["dense_315", 0, 0, {}]]]}, {"name": "concatenate_436", "class_name": "Concatenate", "config": {"name": "concatenate_436", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_312", 0, 0, {}], ["dense_315", 0, 0, {}]]]}, {"name": "dense_317", "class_name": "Dense", "config": {"name": "dense_317", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_291", 0, 0, {}]]]}, {"name": "dense_331", "class_name": "Dense", "config": {"name": "dense_331", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_305", 0, 0, {}]]]}, {"name": "dense_332", "class_name": "Dense", "config": {"name": "dense_332", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_306", 0, 0, {}]]]}, {"name": "dense_346", "class_name": "Dense", "config": {"name": "dense_346", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_320", 0, 0, {}]]]}, {"name": "dense_349", "class_name": "Dense", "config": {"name": "dense_349", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_323", 0, 0, {}]]]}, {"name": "dense_358", "class_name": "Dense", "config": {"name": "dense_358", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_332", 0, 0, {}]]]}, {"name": "dense_364", "class_name": "Dense", "config": {"name": "dense_364", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_338", 0, 0, {}]]]}, {"name": "dense_373", "class_name": "Dense", "config": {"name": "dense_373", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_347", 0, 0, {}]]]}, {"name": "dense_399", "class_name": "Dense", "config": {"name": "dense_399", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_373", 0, 0, {}]]]}, {"name": "dense_400", "class_name": "Dense", "config": {"name": "dense_400", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_374", 0, 0, {}]]]}, {"name": "dense_406", "class_name": "Dense", "config": {"name": "dense_406", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_380", 0, 0, {}]]]}, {"name": "dense_448", "class_name": "Dense", "config": {"name": "dense_448", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_422", 0, 0, {}]]]}, {"name": "dense_462", "class_name": "Dense", "config": {"name": "dense_462", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_436", 0, 0, {}]]]}, {"name": "concatenate_292", "class_name": "Concatenate", "config": {"name": "concatenate_292", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_308", 0, 0, {}], ["dense_317", 0, 0, {}]]]}, {"name": "concatenate_307", "class_name": "Concatenate", "config": {"name": "concatenate_307", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_331", 0, 0, {}], ["dense_332", 0, 0, {}]]]}, {"name": "concatenate_309", "class_name": "Concatenate", "config": {"name": "concatenate_309", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_308", 0, 0, {}], ["dense_310", 0, 0, {}]]]}, {"name": "concatenate_324", "class_name": "Concatenate", "config": {"name": "concatenate_324", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_346", 0, 0, {}], ["dense_349", 0, 0, {}]]]}, {"name": "concatenate_333", "class_name": "Concatenate", "config": {"name": "concatenate_333", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_358", 0, 0, {}], ["dense_312", 0, 0, {}]]]}, {"name": "concatenate_339", "class_name": "Concatenate", "config": {"name": "concatenate_339", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_364", 0, 0, {}], ["dense_315", 0, 0, {}]]]}, {"name": "concatenate_348", "class_name": "Concatenate", "config": {"name": "concatenate_348", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_373", 0, 0, {}], ["dense_308", 0, 0, {}]]]}, {"name": "concatenate_375", "class_name": "Concatenate", "config": {"name": "concatenate_375", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_399", 0, 0, {}], ["dense_400", 0, 0, {}]]]}, {"name": "concatenate_381", "class_name": "Concatenate", "config": {"name": "concatenate_381", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_308", 0, 0, {}], ["dense_406", 0, 0, {}]]]}, {"name": "input_16", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_16"}, "inbound_nodes": []}, {"name": "concatenate_407", "class_name": "Concatenate", "config": {"name": "concatenate_407", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_310", 0, 0, {}], ["dense_308", 0, 0, {}]]]}, {"name": "concatenate_416", "class_name": "Concatenate", "config": {"name": "concatenate_416", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_310", 0, 0, {}], ["dense_315", 0, 0, {}]]]}, {"name": "concatenate_423", "class_name": "Concatenate", "config": {"name": "concatenate_423", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_308", 0, 0, {}], ["dense_448", 0, 0, {}]]]}, {"name": "concatenate_437", "class_name": "Concatenate", "config": {"name": "concatenate_437", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_308", 0, 0, {}], ["dense_462", 0, 0, {}]]]}, {"name": "dense_318", "class_name": "Dense", "config": {"name": "dense_318", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_292", 0, 0, {}]]]}, {"name": "dense_333", "class_name": "Dense", "config": {"name": "dense_333", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_307", 0, 0, {}]]]}, {"name": "dense_335", "class_name": "Dense", "config": {"name": "dense_335", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_309", 0, 0, {}]]]}, {"name": "dense_350", "class_name": "Dense", "config": {"name": "dense_350", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_324", 0, 0, {}]]]}, {"name": "dense_359", "class_name": "Dense", "config": {"name": "dense_359", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_333", 0, 0, {}]]]}, {"name": "dense_365", "class_name": "Dense", "config": {"name": "dense_365", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_339", 0, 0, {}]]]}, {"name": "dense_374", "class_name": "Dense", "config": {"name": "dense_374", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_348", 0, 0, {}]]]}, {"name": "dense_401", "class_name": "Dense", "config": {"name": "dense_401", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_375", 0, 0, {}]]]}, {"name": "dense_407", "class_name": "Dense", "config": {"name": "dense_407", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_381", 0, 0, {}]]]}, {"name": "dense_309", "class_name": "Dense", "config": {"name": "dense_309", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_16", 0, 0, {}]]]}, {"name": "dense_433", "class_name": "Dense", "config": {"name": "dense_433", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_407", 0, 0, {}]]]}, {"name": "dense_442", "class_name": "Dense", "config": {"name": "dense_442", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_416", 0, 0, {}]]]}, {"name": "dense_449", "class_name": "Dense", "config": {"name": "dense_449", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_423", 0, 0, {}]]]}, {"name": "dense_463", "class_name": "Dense", "config": {"name": "dense_463", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_437", 0, 0, {}]]]}, {"name": "concatenate_293", "class_name": "Concatenate", "config": {"name": "concatenate_293", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_318", 0, 0, {}], ["dense_310", 0, 0, {}]]]}, {"name": "concatenate_308", "class_name": "Concatenate", "config": {"name": "concatenate_308", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_333", 0, 0, {}], ["dense_310", 0, 0, {}]]]}, {"name": "concatenate_310", "class_name": "Concatenate", "config": {"name": "concatenate_310", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_308", 0, 0, {}], ["dense_335", 0, 0, {}]]]}, {"name": "concatenate_325", "class_name": "Concatenate", "config": {"name": "concatenate_325", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_350", 0, 0, {}], ["dense_310", 0, 0, {}]]]}, {"name": "concatenate_340", "class_name": "Concatenate", "config": {"name": "concatenate_340", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_359", 0, 0, {}], ["dense_365", 0, 0, {}]]]}, {"name": "concatenate_349", "class_name": "Concatenate", "config": {"name": "concatenate_349", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_306", 0, 0, {}], ["dense_374", 0, 0, {}]]]}, {"name": "concatenate_376", "class_name": "Concatenate", "config": {"name": "concatenate_376", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_401", 0, 0, {}], ["dense_311", 0, 0, {}]]]}, {"name": "concatenate_382", "class_name": "Concatenate", "config": {"name": "concatenate_382", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_407", 0, 0, {}], ["dense_315", 0, 0, {}]]]}, {"name": "concatenate_408", "class_name": "Concatenate", "config": {"name": "concatenate_408", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_310", 0, 0, {}], ["dense_433", 0, 0, {}]]]}, {"name": "concatenate_410", "class_name": "Concatenate", "config": {"name": "concatenate_410", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_311", 0, 0, {}], ["dense_315", 0, 0, {}]]]}, {"name": "concatenate_417", "class_name": "Concatenate", "config": {"name": "concatenate_417", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_310", 0, 0, {}], ["dense_442", 0, 0, {}]]]}, {"name": "concatenate_421", "class_name": "Concatenate", "config": {"name": "concatenate_421", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_312", 0, 0, {}], ["dense_311", 0, 0, {}]]]}, {"name": "concatenate_424", "class_name": "Concatenate", "config": {"name": "concatenate_424", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_449", 0, 0, {}], ["dense_315", 0, 0, {}]]]}, {"name": "concatenate_438", "class_name": "Concatenate", "config": {"name": "concatenate_438", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_309", 0, 0, {}], ["dense_463", 0, 0, {}]]]}, {"name": "dense_319", "class_name": "Dense", "config": {"name": "dense_319", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_293", 0, 0, {}]]]}, {"name": "dense_334", "class_name": "Dense", "config": {"name": "dense_334", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_308", 0, 0, {}]]]}, {"name": "dense_336", "class_name": "Dense", "config": {"name": "dense_336", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_310", 0, 0, {}]]]}, {"name": "dense_351", "class_name": "Dense", "config": {"name": "dense_351", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_325", 0, 0, {}]]]}, {"name": "dense_366", "class_name": "Dense", "config": {"name": "dense_366", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_340", 0, 0, {}]]]}, {"name": "dense_375", "class_name": "Dense", "config": {"name": "dense_375", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_349", 0, 0, {}]]]}, {"name": "dense_402", "class_name": "Dense", "config": {"name": "dense_402", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_376", 0, 0, {}]]]}, {"name": "dense_408", "class_name": "Dense", "config": {"name": "dense_408", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", 