{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_43", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_43"}, "inbound_nodes": []}, {"name": "input_26", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_26"}, "inbound_nodes": []}, {"name": "input_31", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_31"}, "inbound_nodes": []}, {"name": "dense_185", "class_name": "Dense", "config": {"name": "dense_185", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_43", 0, 0, {}]]]}, {"name": "dense_168", "class_name": "Dense", "config": {"name": "dense_168", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_26", 0, 0, {}]]]}, {"name": "dense_173", "class_name": "Dense", "config": {"name": "dense_173", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_31", 0, 0, {}]]]}, {"name": "concatenate_143", "class_name": "Concatenate", "config": {"name": "concatenate_143", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_185", 0, 0, {}], ["dense_185", 0, 0, {}]]]}, {"name": "concatenate_144", "class_name": "Concatenate", "config": {"name": "concatenate_144", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_168", 0, 0, {}], ["dense_173", 0, 0, {}]]]}, {"name": "dense_187", "class_name": "Dense", "config": {"name": "dense_187", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_143", 0, 0, {}]]]}, {"name": "dense_188", "class_name": "Dense", "config": {"name": "dense_188", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_144", 0, 0, {}]]]}, {"name": "input_42", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_42"}, "inbound_nodes": []}, {"name": "concatenate_145", "class_name": "Concatenate", "config": {"name": "concatenate_145", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_187", 0, 0, {}], ["dense_188", 0, 0, {}]]]}, {"name": "input_25", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_25"}, "inbound_nodes": []}, {"name": "dense_184", "class_name": "Dense", "config": {"name": "dense_184", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_42", 0, 0, {}]]]}, {"name": "dense_189", "class_name": "Dense", "config": {"name": "dense_189", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_145", 0, 0, {}]]]}, {"name": "dense_167", "class_name": "Dense", "config": {"name": "dense_167", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_25", 0, 0, {}]]]}, {"name": "concatenate_146", "class_name": "Concatenate", "config": {"name": "concatenate_146", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_189", 0, 0, {}], ["dense_184", 0, 0, {}]]]}, {"name": "concatenate_147", "class_name": "Concatenate", "config": {"name": "concatenate_147", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_167", 0, 0, {}], ["dense_184", 0, 0, {}]]]}, {"name": "input_40", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_40"}, "inbound_nodes": []}, {"name": "input_32", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_32"}, "inbound_nodes": []}, {"name": "dense_190", "class_name": "Dense", "config": {"name": "dense_190", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_146", 0, 0, {}]]]}, {"name": "dense_191", "class_name": "Dense", "config": {"name": "dense_191", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_147", 0, 0, {}]]]}, {"name": "dense_182", "class_name": "Dense", "config": {"name": "dense_182", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_40", 0, 0, {}]]]}, {"name": "dense_174", "class_name": "Dense", "config": {"name": "dense_174", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_32", 0, 0, {}]]]}, {"name": "input_38", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_38"}, "inbound_nodes": []}, {"name": "concatenate_148", "class_name": "Concatenate", "config": {"name": "concatenate_148", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_190", 0, 0, {}], ["dense_191", 0, 0, {}]]]}, {"name": "concatenate_152", "class_name": "Concatenate", "config": {"name": "concatenate_152", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_182", 0, 0, {}], ["dense_174", 0, 0, {}]]]}, {"name": "dense_180", "class_name": "Dense", "config": {"name": "dense_180", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_38", 0, 0, {}]]]}, {"name": "dense_192", "class_name": "Dense", "config": {"name": "dense_192", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_148", 0, 0, {}]]]}, {"name": "dense_196", "class_name": "Dense", "config": {"name": "dense_196", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_152", 0, 0, {}]]]}, {"name": "concatenate_142", "class_name": "Concatenate", "config": {"name": "concatenate_142", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_180", 0, 0, {}], ["dense_184", 0, 0, {}]]]}, {"name": "concatenate_149", "class_name": "Concatenate", "config": {"name": "concatenate_149", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_192", 0, 0, {}], ["dense_185", 0, 0, {}]]]}, {"name": "concatenate_153", "class_name": "Concatenate", "config": {"name": "concatenate_153", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_196", 0, 0, {}], ["dense_184", 0, 0, {}]]]}, {"name": "dense_186", "class_name": "Dense", "config": {"name": "dense_186", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_142", 0, 0, {}]]]}, {"name": "dense_193", "class_name": "Dense", "config": {"name": "dense_193", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_149", 0, 0, {}]]]}, {"name": "dense_197", "class_name": "Dense", "config": {"name": "dense_197", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_153", 0, 0, {}]]]}, {"name": "concatenate_150", "class_name": "Concatenate", "config": {"name": "concatenate_150", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_186", 0, 0, {}], ["dense_193", 0, 0, {}]]]}, {"name": "concatenate_154", "class_name": "Concatenate", "config": {"name": "concatenate_154", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_174", 0, 0, {}], ["dense_197", 0, 0, {}]]]}, {"name": "dense_194", "class_name": "Dense", "config": {"name": "dense_194", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_150", 0, 0, {}]]]}, {"name": "dense_198", "class_name": "Dense", "config": {"name": "dense_198", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_154", 0, 0, {}]]]}, {"name": "concatenate_151", "class_name": "Concatenate", "config": {"name": "concatenate_151", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_194", 0, 0, {}], ["dense_182", 0, 0, {}]]]}, {"name": "concatenate_155", "class_name": "Concatenate", "config": {"name": "concatenate_155", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_198", 0, 0, {}], ["dense_184", 0, 0, {}]]]}, {"name": "dense_195", "class_name": "Dense", "config": {"name": "dense_195", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_151", 0, 0, {}]]]}, {"name": "dense_199", "class_name": "Dense", "config": {"name": "dense_199", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_155", 0, 0, {}]]]}, {"name": "concatenate_156", "class_name": "Concatenate", "config": {"name": "concatenate_156", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_195", 0, 0, {}], ["dense_199", 0, 0, {}]]]}, {"name": "dense_200", "class_name": "Dense", "config": {"name": "dense_200", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_156", 0, 0, {}]]]}, {"name": "concatenate_157", "class_name": "Concatenate", "config": {"name": "concatenate_157", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_200", 0, 0, {}], ["dense_185", 0, 0, {}]]]}, {"name": "dense_201", "class_name": "Dense", "config": {"name": "dense_201", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_157", 0, 0, {}]]]}, {"name": "concatenate_158", "class_name": "Concatenate", "config": {"name": "concatenate_158", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_201", 0, 0, {}], ["dense_184", 0, 0, {}]]]}, {"name": "dense_202", "class_name": "Dense", "config": {"name": "dense_202", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_158", 0, 0, {}]]]}, {"name": "concatenate_159", "class_name": "Concatenate", "config": {"name": "concatenate_159", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_202", 0, 0, {}], ["dense_184", 0, 0, {}]]]}, {"name": "dense_203", "class_name": "Dense", "config": {"name": "dense_203", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_159", 0, 0, {}]]]}, {"name": "concatenate_160", "class_name": "Concatenate", "config": {"name": "concatenate_160", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_203", 0, 0, {}], ["dense_184", 0, 0, {}]]]}, {"name": "dense_204", "class_name": "Dense", "config": {"name": "dense_204", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_160", 0, 0, {}]]]}, {"name": "dense_205", "class_name": "Dense", "config": {"name": "dense_205", "trainable": true, "dtype": "float32", "units": 7, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_204", 0, 0, {}]]]}], "input_layers": [["input_25", 0, 0], ["input_26", 0, 0], ["input_31", 0, 0], ["input_32", 0, 0], ["input_38", 0, 0], ["input_40", 0, 0], ["input_42", 0, 0], ["input_43", 0, 0]], "output_layers": [["dense_205", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}