{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_9", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_9"}, "inbound_nodes": []}, {"name": "dense_120", "class_name": "Dense", "config": {"name": "dense_120", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "input_10", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_10"}, "inbound_nodes": []}, {"name": "input_12", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_12"}, "inbound_nodes": []}, {"name": "input_8", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_8"}, "inbound_nodes": []}, {"name": "input_11", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_11"}, "inbound_nodes": []}, {"name": "concatenate_158", "class_name": "Concatenate", "config": {"name": "concatenate_158", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_159", "class_name": "Concatenate", "config": {"name": "concatenate_159", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_188", "class_name": "Concatenate", "config": {"name": "concatenate_188", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_189", "class_name": "Concatenate", "config": {"name": "concatenate_189", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "dense_121", "class_name": "Dense", "config": {"name": "dense_121", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"name": "dense_123", "class_name": "Dense", "config": {"name": "dense_123", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_12", 0, 0, {}]]]}, {"name": "dense_119", "class_name": "Dense", "config": {"name": "dense_119", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"name": "dense_122", "class_name": "Dense", "config": {"name": "dense_122", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"name": "dense_172", "class_name": "Dense", "config": {"name": "dense_172", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_158", 0, 0, {}]]]}, {"name": "dense_173", "class_name": "Dense", "config": {"name": "dense_173", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_159", 0, 0, {}]]]}, {"name": "dense_202", "class_name": "Dense", "config": {"name": "dense_202", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_188", 0, 0, {}]]]}, {"name": "dense_203", "class_name": "Dense", "config": {"name": "dense_203", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_189", 0, 0, {}]]]}, {"name": "concatenate_138", "class_name": "Concatenate", "config": {"name": "concatenate_138", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_121", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "concatenate_140", "class_name": "Concatenate", "config": {"name": "concatenate_140", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_121", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "concatenate_144", "class_name": "Concatenate", "config": {"name": "concatenate_144", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_122", 0, 0, {}], ["dense_122", 0, 0, {}]]]}, {"name": "concatenate_146", "class_name": "Concatenate", "config": {"name": "concatenate_146", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_152", "class_name": "Concatenate", "config": {"name": "concatenate_152", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_121", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "concatenate_154", "class_name": "Concatenate", "config": {"name": "concatenate_154", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_121", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "concatenate_160", "class_name": "Concatenate", "config": {"name": "concatenate_160", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_172", 0, 0, {}], ["dense_173", 0, 0, {}]]]}, {"name": "concatenate_168", "class_name": "Concatenate", "config": {"name": "concatenate_168", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_121", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "concatenate_170", "class_name": "Concatenate", "config": {"name": "concatenate_170", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_119", 0, 0, {}], ["dense_119", 0, 0, {}]]]}, {"name": "concatenate_174", "class_name": "Concatenate", "config": {"name": "concatenate_174", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_119", 0, 0, {}], ["dense_119", 0, 0, {}]]]}, {"name": "concatenate_176", "class_name": "Concatenate", "config": {"name": "concatenate_176", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_119", 0, 0, {}], ["dense_119", 0, 0, {}]]]}, {"name": "concatenate_182", "class_name": "Concatenate", "config": {"name": "concatenate_182", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_184", "class_name": "Concatenate", "config": {"name": "concatenate_184", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_190", "class_name": "Concatenate", "config": {"name": "concatenate_190", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_202", 0, 0, {}], ["dense_203", 0, 0, {}]]]}, {"name": "concatenate_210", "class_name": "Concatenate", "config": {"name": "concatenate_210", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_214", "class_name": "Concatenate", "config": {"name": "concatenate_214", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_121", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "concatenate_224", "class_name": "Concatenate", "config": {"name": "concatenate_224", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_226", "class_name": "Concatenate", "config": {"name": "concatenate_226", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_121", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "concatenate_230", "class_name": "Concatenate", "config": {"name": "concatenate_230", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_232", "class_name": "Concatenate", "config": {"name": "concatenate_232", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_238", "class_name": "Concatenate", "config": {"name": "concatenate_238", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_121", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "concatenate_240", "class_name": "Concatenate", "config": {"name": "concatenate_240", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_244", "class_name": "Concatenate", "config": {"name": "concatenate_244", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_121", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "concatenate_246", "class_name": "Concatenate", "config": {"name": "concatenate_246", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_121", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "concatenate_255", "class_name": "Concatenate", "config": {"name": "concatenate_255", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_121", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "concatenate_259", "class_name": "Concatenate", "config": {"name": "concatenate_259", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_261", "class_name": "Concatenate", "config": {"name": "concatenate_261", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_267", "class_name": "Concatenate", "config": {"name": "concatenate_267", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_122", 0, 0, {}], ["dense_122", 0, 0, {}]]]}, {"name": "concatenate_269", "class_name": "Concatenate", "config": {"name": "concatenate_269", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_122", 0, 0, {}], ["dense_122", 0, 0, {}]]]}, {"name": "concatenate_273", "class_name": "Concatenate", "config": {"name": "concatenate_273", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_121", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "concatenate_275", "class_name": "Concatenate", "config": {"name": "concatenate_275", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_123", 0, 0, {}], ["dense_123", 0, 0, {}]]]}, {"name": "dense_152", "class_name": "Dense", "config": {"name": "dense_152", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_138", 0, 0, {}]]]}, {"name": "dense_154", "class_name": "Dense", "config": {"name": "dense_154", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_140", 0, 0, {}]]]}, {"name": "dense_158", "class_name": "Dense", "config": {"name": "dense_158", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_144", 0, 0, {}]]]}, {"name": "dense_160", "class_name": "Dense", "config": {"name": "dense_160", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_146", 0, 0, {}]]]}, {"name": "dense_166", "class_name": "Dense", "config": {"name": "dense_166", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_152", 0, 0, {}]]]}, {"name": "dense_168", "class_name": "Dense", "config": {"name": "dense_168", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_154", 0, 0, {}]]]}, {"name": "dense_174", "class_name": "Dense", "config": {"name": "dense_174", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_160", 0, 0, {}]]]}, {"name": "dense_182", "class_name": "Dense", "config": {"name": "dense_182", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_168", 0, 0, {}]]]}, {"name": "dense_184", "class_name": "Dense", "config": {"name": "dense_184", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_170", 0, 0, {}]]]}, {"name": "dense_188", "class_name": "Dense", "config": {"name": "dense_188", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_174", 0, 0, {}]]]}, {"name": "dense_190", "class_name": "Dense", "config": {"name": "dense_190", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_176", 0, 0, {}]]]}, {"name": "dense_196", "class_name": "Dense", "config": {"name": "dense_196", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_182", 0, 0, {}]]]}, {"name": "dense_198", "class_name": "Dense", "config": {"name": "dense_198", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_184", 0, 0, {}]]]}, {"name": "dense_204", "class_name": "Dense", "config": {"name": "dense_204", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_190", 0, 0, {}]]]}, {"name": "dense_224", "class_name": "Dense", "config": {"name": "dense_224", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_210", 0, 0, {}]]]}, {"name": "dense_228", "class_name": "Dense", "config": {"name": "dense_228", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_214", 0, 0, {}]]]}, {"name": "dense_238", "class_name": "Dense", "config": {"name": "dense_238", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_224", 0, 0, {}]]]}, {"name": "dense_240", "class_name": "Dense", "config": {"name": "dense_240", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_226", 0, 0, {}]]]}, {"name": "dense_244", "class_name": "Dense", "config": {"name": "dense_244", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_230", 0, 0, {}]]]}, {"name": "dense_246", "class_name": "Dense", "config": {"name": "dense_246", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_232", 0, 0, {}]]]}, {"name": "dense_252", "class_name": "Dense", "config": {"name": "dense_252", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_238", 0, 0, {}]]]}, {"name": "dense_254", "class_name": "Dense", "config": {"name": "dense_254", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_240", 0, 0, {}]]]}, {"name": "dense_258", "class_name": "Dense", "config": {"name": "dense_258", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_244", 0, 0, {}]]]}, {"name": "dense_260", "class_name": "Dense", "config": {"name": "dense_260", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_246", 0, 0, {}]]]}, {"name": "dense_269", "class_name": "Dense", "config": {"name": "dense_269", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_255", 0, 0, {}]]]}, {"name": "dense_273", "class_name": "Dense", "config": {"name": "dense_273", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_259", 0, 0, {}]]]}, {"name": "dense_275", "class_name": "Dense", "config": {"name": "dense_275", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_261", 0, 0, {}]]]}, {"name": "dense_281", "class_name": "Dense", "config": {"name": "dense_281", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_267", 0, 0, {}]]]}, {"name": "dense_283", "class_name": "Dense", "config": {"name": "dense_283", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_269", 0, 0, {}]]]}, {"name": "dense_287", "class_name": "Dense", "config": {"name": "dense_287", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_273", 0, 0, {}]]]}, {"name": "dense_289", "class_name": "Dense", "config": {"name": "dense_289", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_275", 0, 0, {}]]]}, {"name": "concatenate_111", "class_name": "Concatenate", "config": {"name": "concatenate_111", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_112", "class_name": "Concatenate", "config": {"name": "concatenate_112", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_115", "class_name": "Concatenate", "config": {"name": "concatenate_115", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_116", "class_name": "Concatenate", "config": {"name": "concatenate_116", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_124", "class_name": "Concatenate", "config": {"name": "concatenate_124", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_125", "class_name": "Concatenate", "config": {"name": "concatenate_125", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_128", "class_name": "Concatenate", "config": {"name": "concatenate_128", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_129", "class_name": "Concatenate", "config": {"name": "concatenate_129", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_139", "class_name": "Concatenate", "config": {"name": "concatenate_139", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_152", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_141", "class_name": "Concatenate", "config": {"name": "concatenate_141", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_154", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_145", "class_name": "Concatenate", "config": {"name": "concatenate_145", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_158", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_147", "class_name": "Concatenate", "config": {"name": "concatenate_147", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_160", 0, 0, {}], ["dense_122", 0, 0, {}]]]}, {"name": "concatenate_153", "class_name": "Concatenate", "config": {"name": "concatenate_153", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_166", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_155", "class_name": "Concatenate", "config": {"name": "concatenate_155", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_168", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_161", "class_name": "Concatenate", "config": {"name": "concatenate_161", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_174", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "concatenate_169", "class_name": "Concatenate", "config": {"name": "concatenate_169", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_182", 0, 0, {}], ["dense_119", 0, 0, {}]]]}, {"name": "concatenate_171", "class_name": "Concatenate", "config": {"name": "concatenate_171", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_184", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "concatenate_175", "class_name": "Concatenate", "config": {"name": "concatenate_175", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_188", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_177", "class_name": "Concatenate", "config": {"name": "concatenate_177", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_190", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_183", "class_name": "Concatenate", "config": {"name": "concatenate_183", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_196", 0, 0, {}]]]}, {"name": "concatenate_185", "class_name": "Concatenate", "config": {"name": "concatenate_185", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_198", 0, 0, {}]]]}, {"name": "concatenate_191", "class_name": "Concatenate", "config": {"name": "concatenate_191", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_204", 0, 0, {}], ["dense_119", 0, 0, {}]]]}, {"name": "concatenate_211", "class_name": "Concatenate", "config": {"name": "concatenate_211", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_224", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "concatenate_215", "class_name": "Concatenate", "config": {"name": "concatenate_215", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_228", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_225", "class_name": "Concatenate", "config": {"name": "concatenate_225", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_238", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "concatenate_227", "class_name": "Concatenate", "config": {"name": "concatenate_227", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_240", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_231", "class_name": "Concatenate", "config": {"name": "concatenate_231", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_244", 0, 0, {}]]]}, {"name": "concatenate_233", "class_name": "Concatenate", "config": {"name": "concatenate_233", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_246", 0, 0, {}]]]}, {"name": "concatenate_239", "class_name": "Concatenate", "config": {"name": "concatenate_239", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_252", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_241", "class_name": "Concatenate", "config": {"name": "concatenate_241", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_254", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "concatenate_245", "class_name": "Concatenate", "config": {"name": "concatenate_245", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_258", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_247", "class_name": "Concatenate", "config": {"name": "concatenate_247", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_260", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_254", "class_name": "Concatenate", "config": {"name": "concatenate_254", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "concatenate_256", "class_name": "Concatenate", "config": {"name": "concatenate_256", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_269", 0, 0, {}], ["dense_120", 0, 0, {}]]]}, {"name": "concatenate_260", "class_name": "Concatenate", "config": {"name": "concatenate_260", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_273", 0, 0, {}], ["dense_123", 0, 0, {}]]]}, {"name": "concatenate_262", "class_name": "Concatenate", "config": {"name": "concatenate_262", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_275", 0, 0, {}], ["dense_123", 0, 0, {}]]]}, {"name": "concatenate_268", "class_name": "Concatenate", "config": {"name": "concatenate_268", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_281", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "concatenate_270", "class_name": "Concatenate", "config": {"name": "concatenate_270", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_283", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "concatenate_274", "class_name": "Concatenate", "config": {"name": "concatenate_274", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_287", 0, 0, {}], ["dense_123", 0, 0, {}]]]}, {"name": "concatenate_276", "class_name": "Concatenate", "config": {"name": "concatenate_276", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_289", 0, 0, {}], ["dense_121", 0, 0, {}]]]}, {"name": "dense_125", "class_name": "Dense", "config": {"name": "dense_125", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_111", 0, 0, {}]]]}, {"name": "dense_126", "class_name": "Dense", "config": {"name": "dense_126", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_112", 0, 0, {}]]]}, {"name": "dense_129", "class_name": "Dense", "config": {"name": "dense_129", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_115", 0, 0, {}]]]}, {"name": "dense_130", "class_name": "Dense", "config": {"name": "dense_130", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_116", 0, 0, {}]]]}, {"name": "dense_138", "class_name": "Dense", "config": {"name": "dense_138", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_124", 0, 0, {}]]]}, {"name": "dense_139", "class_name": "Dense", "config": {"name": "dense_139", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_125", 0, 0, {}]]]}, {"name": "dense_142", "class_name": "Dense", "config": {"name": "dense_142", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_128", 0, 0, {}]]]}, {"name": "dense_143", "class_name": "Dense", "config": {"name": "dense_143", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_129", 0, 0, {}]]]}, {"name": "dense_153", "class_name": "Dense", "config": {"name": "dense_153", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_139", 0, 0, {}]]]}, {"name": "dense_155", "class_name": "Dense", "config": {"name": "dense_155", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_141", 0, 0, {}]]]}, {"name": "dense_159", "class_name": "Dense", "config": {"name": "dense_159", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_145", 0, 0, {}]]]}, {"name": "dense_161", "class_name": "Dense", "config": {"name": "dense_161", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_147", 0, 0, {}]]]}, {"name": "dense_167", "class_name": "Dense", "config": {"name": "dense_167", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_153", 0, 0, {}]]]}, {"name": "dense_169", "class_name": "Dense", "config": {"name": "dense_169", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_155", 0, 0, {}]]]}, {"name": "dense_175", "class_name": "Dense", "config": {"name": "dense_175", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_161", 0, 0, {}]]]}, {"name": "dense_183", "class_name": "Dense", "config": {"name": "dense_183", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_169", 0, 0, {}]]]}, {"name": "dense_185", "class_name": "Dense", "config": {"name": "dense_185", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_171", 0, 0, {}]]]}, {"name": "dense_189", "class_name": "Dense", "config": {"name": "dense_189", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_175", 0, 0, {}]]]}, {"name": "dense_191", "class_name": "Dense", "config": {"name": "dense_191", "trainable": true, 