{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_7", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_7"}, "inbound_nodes": []}, {"name": "input_6", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_6"}, "inbound_nodes": []}, {"name": "input_5", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_5"}, "inbound_nodes": []}, {"name": "dense_15", "class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"name": "dense_14", "class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "dense_13", "class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"name": "concatenate_21", "class_name": "Concatenate", "config": {"name": "concatenate_21", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_14", 0, 0, {}], ["dense_15", 0, 0, {}]]]}, {"name": "concatenate_90", "class_name": "Concatenate", "config": {"name": "concatenate_90", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_13", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "dense_29", "class_name": "Dense", "config": {"name": "dense_29", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_21", 0, 0, {}]]]}, {"name": "dense_98", "class_name": "Dense", "config": {"name": "dense_98", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_90", 0, 0, {}]]]}, {"name": "concatenate_22", "class_name": "Concatenate", "config": {"name": "concatenate_22", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_29", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_48", "class_name": "Concatenate", "config": {"name": "concatenate_48", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_14", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_91", "class_name": "Concatenate", "config": {"name": "concatenate_91", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_98", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "dense_30", "class_name": "Dense", "config": {"name": "dense_30", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_22", 0, 0, {}]]]}, {"name": "dense_56", "class_name": "Dense", "config": {"name": "dense_56", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_48", 0, 0, {}]]]}, {"name": "dense_99", "class_name": "Dense", "config": {"name": "dense_99", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_91", 0, 0, {}]]]}, {"name": "concatenate_23", "class_name": "Concatenate", "config": {"name": "concatenate_23", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_14", 0, 0, {}], ["dense_30", 0, 0, {}]]]}, {"name": "concatenate_43", "class_name": "Concatenate", "config": {"name": "concatenate_43", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_13", 0, 0, {}], ["dense_13", 0, 0, {}]]]}, {"name": "concatenate_49", "class_name": "Concatenate", "config": {"name": "concatenate_49", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_13", 0, 0, {}], ["dense_56", 0, 0, {}]]]}, {"name": "concatenate_84", "class_name": "Concatenate", "config": {"name": "concatenate_84", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_13", 0, 0, {}], ["dense_13", 0, 0, {}]]]}, {"name": "concatenate_92", "class_name": "Concatenate", "config": {"name": "concatenate_92", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_14", 0, 0, {}], ["dense_99", 0, 0, {}]]]}, {"name": "dense_31", "class_name": "Dense", "config": {"name": "dense_31", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_23", 0, 0, {}]]]}, {"name": "dense_51", "class_name": "Dense", "config": {"name": "dense_51", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_43", 0, 0, {}]]]}, {"name": "dense_57", "class_name": "Dense", "config": {"name": "dense_57", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_49", 0, 0, {}]]]}, {"name": "dense_92", "class_name": "Dense", "config": {"name": "dense_92", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_84", 0, 0, {}]]]}, {"name": "dense_100", "class_name": "Dense", "config": {"name": "dense_100", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_92", 0, 0, {}]]]}, {"name": "concatenate_13", "class_name": "Concatenate", "config": {"name": "concatenate_13", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_14", 0, 0, {}], ["dense_15", 0, 0, {}]]]}, {"name": "concatenate_24", "class_name": "Concatenate", "config": {"name": "concatenate_24", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_14", 0, 0, {}], ["dense_31", 0, 0, {}]]]}, {"name": "concatenate_36", "class_name": "Concatenate", "config": {"name": "concatenate_36", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_13", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_44", "class_name": "Concatenate", "config": {"name": "concatenate_44", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_51", 0, 0, {}], ["dense_13", 0, 0, {}]]]}, {"name": "concatenate_50", "class_name": "Concatenate", "config": {"name": "concatenate_50", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_57", 0, 0, {}], ["dense_13", 0, 0, {}]]]}, {"name": "concatenate_52", "class_name": "Concatenate", "config": {"name": "concatenate_52", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_13", 0, 0, {}], ["dense_13", 0, 0, {}]]]}, {"name": "concatenate_85", "class_name": "Concatenate", "config": {"name": "concatenate_85", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_92", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_93", "class_name": "Concatenate", "config": {"name": "concatenate_93", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_13", 0, 0, {}], ["dense_100", 0, 0, {}]]]}, {"name": "dense_21", "class_name": "Dense", "config": {"name": "dense_21", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_13", 0, 0, {}]]]}, {"name": "dense_32", "class_name": "Dense", "config": {"name": "dense_32", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_24", 0, 0, {}]]]}, {"name": "dense_44", "class_name": "Dense", "config": {"name": "dense_44", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_36", 0, 0, {}]]]}, {"name": "dense_52", "class_name": "Dense", "config": {"name": "dense_52", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_44", 0, 0, {}]]]}, {"name": "dense_58", "class_name": "Dense", "config": {"name": "dense_58", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_50", 0, 0, {}]]]}, {"name": "dense_60", "class_name": "Dense", "config": {"name": "dense_60", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_52", 0, 0, {}]]]}, {"name": "dense_93", "class_name": "Dense", "config": {"name": "dense_93", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_85", 0, 0, {}]]]}, {"name": "dense_101", "class_name": "Dense", "config": {"name": "dense_101", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_93", 0, 0, {}]]]}, {"name": "concatenate_14", "class_name": "Concatenate", "config": {"name": "concatenate_14", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_13", 0, 0, {}], ["dense_21", 0, 0, {}]]]}, {"name": "concatenate_19", "class_name": "Concatenate", "config": {"name": "concatenate_19", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_13", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_25", "class_name": "Concatenate", "config": {"name": "concatenate_25", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_32", 0, 0, {}], ["dense_13", 0, 0, {}]]]}, {"name": "concatenate_37", "class_name": "Concatenate", "config": {"name": "concatenate_37", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_44", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_38", "class_name": "Concatenate", "config": {"name": "concatenate_38", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_14", 0, 0, {}], ["dense_13", 0, 0, {}]]]}, {"name": "concatenate_45", "class_name": "Concatenate", "config": {"name": "concatenate_45", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_52", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_51", "class_name": "Concatenate", "config": {"name": "concatenate_51", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_58", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_53", "class_name": "Concatenate", "config": {"name": "concatenate_53", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_14", 0, 0, {}], ["dense_60", 0, 0, {}]]]}, {"name": "concatenate_86", "class_name": "Concatenate", "config": {"name": "concatenate_86", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_13", 0, 0, {}], ["dense_93", 0, 0, {}]]]}, {"name": "concatenate_94", "class_name": "Concatenate", "config": {"name": "concatenate_94", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_15", 0, 0, {}], ["dense_101", 0, 0, {}]]]}, {"name": "dense_22", "class_name": "Dense", "config": {"name": "dense_22", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_14", 0, 0, {}]]]}, {"name": "dense_27", "class_name": "Dense", "config": {"name": "dense_27", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_19", 0, 0, {}]]]}, {"name": "dense_33", "class_name": "Dense", "config": {"name": "dense_33", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_25", 0, 0, {}]]]}, {"name": "dense_45", "class_name": "Dense", "config": {"name": "dense_45", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_37", 0, 0, {}]]]}, {"name": "dense_46", "class_name": "Dense", "config": {"name": "dense_46", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_38", 0, 0, {}]]]}, {"name": "dense_53", "class_name": "Dense", "config": {"name": "dense_53", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_45", 0, 0, {}]]]}, {"name": "dense_59", "class_name": "Dense", "config": {"name": "dense_59", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_51", 0, 0, {}]]]}, {"name": "dense_61", "class_name": "Dense", "config": {"name": "dense_61", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_53", 0, 0, {}]]]}, {"name": "dense_94", "class_name": "Dense", "config": {"name": "dense_94", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_86", 0, 0, {}]]]}, {"name": "dense_102", "class_name": "Dense", "config": {"name": "dense_102", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_94", 0, 0, {}]]]}, {"name": "concatenate_15", "class_name": "Concatenate", "config": {"name": "concatenate_15", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_22", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_16", "class_name": "Concatenate", "config": {"name": "concatenate_16", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_13", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_20", "class_name": "Concatenate", "config": {"name": "concatenate_20", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_27", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_26", "class_name": "Concatenate", "config": {"name": "concatenate_26", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_33", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_34", "class_name": "Concatenate", "config": {"name": "concatenate_34", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_13", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_39", "class_name": "Concatenate", "config": {"name": "concatenate_39", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_45", 0, 0, {}], ["dense_46", 0, 0, {}]]]}, {"name": "concatenate_46", "class_name": "Concatenate", "config": {"name": "concatenate_46", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_53", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_54", "class_name": "Concatenate", "config": {"name": "concatenate_54", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_59", 0, 0, {}], ["dense_61", 0, 0, {}]]]}, {"name": "concatenate_87", "class_name": "Concatenate", "config": {"name": "concatenate_87", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_94", 0, 0, {}], ["dense_15", 0, 0, {}]]]}, {"name": "concatenate_95", "class_name": "Concatenate", "config": {"name": "concatenate_95", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_102", 0, 0, {}], ["dense_13", 0, 0, {}]]]}, {"name": "dense_23", "class_name": "Dense", "config": {"name": "dense_23", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_15", 0, 0, {}]]]}, {"name": "dense_24", "class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_16", 0, 0, {}]]]}, {"name": "dense_28", "class_name": "Dense", "config": {"name": "dense_28", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_20", 0, 0, {}]]]}, {"name": "dense_34", "class_name": "Dense", "config": {"name": "dense_34", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_26", 0, 0, {}]]]}, {"name": "dense_42", "class_name": "Dense", "config": {"name": "dense_42", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_34", 0, 0, {}]]]}, {"name": "dense_47", "class_name": "Dense", "config": {"name": "dense_47", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_39", 0, 0, {}]]]}, {"name": "dense_54", "class_name": "Dense", "config": {"name": "dense_54", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_46", 0, 0, {}]]]}, {"name": "dense_62", "class_name": "Dense", "config": {"name": "dense_62", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_54", 0, 0, {}]]]}, {"name": "dense_95", "class_name": "Dense", "config": {"name": "dense_95", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_87", 0, 0, {}]]]}, {"name": "dense_103", "class_name": "Dense", "config": {"name": "dense_103", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_95", 0, 0, {}]]]}, {"name": "concatenate_17", "class_name": "Concatenate", "config": {"name": "concatenate_17", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_23", 0, 0, {}], ["dense_24", 0, 0, {}]]]}, {"name": "concatenate_27", "class_name": "Concatenate", "config": {"name": "concatenate_27", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_28", 0, 0, {}], ["dense_34", 0, 0, {}]]]}, {"name": "concatenate_35", "class_name": "Concatenate", "config": {"name": "concatenate_35", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_15", 0, 0, {}], ["dense_42", 0, 0, {}]]]}, {"name": "concatenate_40", "class_name": "Concatenate", "config": {"name": "concatenate_40", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_47", 0, 0, {}], ["dense_15", 0, 0, {}]]]}, {"name": "concatenate_47", "class_name": "Concatenate", "config": {"name": "concatenate_47", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_54", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_55", "class_name": "Concatenate", "config": {"name": "concatenate_55", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_62", 0, 0, {}], ["dense_15", 0, 0, {}]]]}, {"name": "concatenate_88", "class_name": "Concatenate", "config": {"name": "concatenate_88", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_95", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_96", "class_name": "Concatenate", "config": {"name": "concatenate_96", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_103", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "dense_25", "class_name": "Dense", "config": {"name": "dense_25", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_17", 0, 0, {}]]]}, {"name": "dense_35", "class_name": "Dense", "config": {"name": "dense_35", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_27", 0, 0, {}]]]}, {"name": "dense_43", "class_name": "Dense", "config": {"name": "dense_43", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_35", 0, 0, {}]]]}, {"name": "dense_48", "class_name": "Dense", "config": {"name": "dense_48", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_40", 0, 0, {}]]]}, {"name": "dense_55", "class_name": "Dense", "config": {"name": "dense_55", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_47", 0, 0, {}]]]}, {"name": "dense_63", "class_name": "Dense", "config": {"name": "dense_63", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_55", 0, 0, {}]]]}, {"name": "dense_96", "class_name": "Dense", "config": {"name": "dense_96", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_88", 0, 0, {}]]]}, {"name": "dense_104", "class_name": "Dense", "config": {"name": "dense_104", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_96", 0, 0, {}]]]}, {"name": "concatenate_8", "class_name": "Concatenate", "config": {"name": "concatenate_8", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_15", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_18", "class_name": "Concatenate", "config": {"name": "concatenate_18", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_25", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_28", "class_name": "Concatenate", "config": {"name": "concatenate_28", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_35", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_41", "class_name": "Concatenate", "config": {"name": "concatenate_41", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_43", 0, 0, {}], ["dense_48", 0, 0, {}]]]}, {"name": "concatenate_56", "class_name": "Concatenate", "config": {"name": "concatenate_56", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_55", 0, 0, {}], ["dense_63", 0, 0, {}]]]}, {"name": "concatenate_69", "class_name": "Concatenate", "config": {"name": "concatenate_69", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_13", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_89", "class_name": "Concatenate", "config": {"name": "concatenate_89", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_13", 0, 0, {}], ["dense_96", 0, 0, {}]]]}, {"name": "concatenate_97", "class_name": "Concatenate", "config": {"name": "concatenate_97", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_104", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "dense_16", "class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"name": "dense_26", "class_name": "Dense", "config": {"name": "dense_26", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_18", 0, 0, {}]]]}, {"name": "dense_36", "class_name": "Dense", "config": {"name": "dense_36", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_28", 0, 0, {}]]]}, {"name": "dense_49", "class_name": "Dense", "config": {"name": "dense_49", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_41", 0, 0, {}]]]}, {"name": "dense_64", "class_name": "Dense", "config": {"name": "dense_64", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_56", 0, 0, {}]]]}, {"name": "dense_77", "class_name": "Dense", "config": {"name": "dense_77", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_69", 0, 0, {}]]]}, {"name": "dense_97", "class_name": "Dense", "config": {"name": "dense_97", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_89", 0, 0, {}]]]}, {"name": "dense_105", "class_name": "Dense", "config": {"name": "dense_105", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_97", 0, 0, {}]]]}, {"name": "concatenate_9", "class_name": "Concatenate", "config": {"name": "concatenate_9", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_16", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_10", "class_name": "Concatenate", "config": {"name": "concatenate_10", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_13", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_29", "class_name": "Concatenate", "config": {"name": "concatenate_29", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_26", 0, 0, {}], ["dense_36", 0, 0, {}]]]}, {"name": "concatenate_42", "class_name": "Concatenate", "config": {"name": "concatenate_42", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_49", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_57", "class_name": "Concatenate", "config": {"name": "concatenate_57", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_64", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_68", "class_name": "Concatenate", "config": {"name": "concatenate_68", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_13", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_70", "class_name": "Concatenate", "config": {"name": "concatenate_70", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_77", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "concatenate_98", "class_name": "Concatenate", "config": {"name": "concatenate_98", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_97", 0, 0, {}], ["dense_105", 0, 0, {}]]]}, {"name": "dense_17", "class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}, {"name": "dense_18", "class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_10", 0, 0, {}]]]}, {"name": "dense_37", "class_name": "Dense", "config": {"name": "dense_37", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_29", 0, 0, {}]]]}, {"name": "dense_50", "class_name": "Dense", "config": {"name": "dense_50", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_42", 0, 0, {}]]]}, {"name": "dense_65", "class_name": "Dense", "config": {"name": "dense_65", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_57", 0, 0, {}]]]}, {"name": "dense_76", "class_name": "Dense", "config": {"name": "dense_76", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_68", 0, 0, {}]]]}, {"name": "dense_78", "class_name": "Dense", "config": {"name": "dense_78", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_70", 0, 0, {}]]]}, {"name": "dense_106", "class_name": "Dense", "config": {"name": "dense_106", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, 