{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_12", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_12"}, "inbound_nodes": []}, {"name": "input_11", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_11"}, "inbound_nodes": []}, {"name": "input_15", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_15"}, "inbound_nodes": []}, {"name": "input_16", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_16"}, "inbound_nodes": []}, {"name": "input_14", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_14"}, "inbound_nodes": []}, {"name": "input_19", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_19"}, "inbound_nodes": []}, {"name": "input_18", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_18"}, "inbound_nodes": []}, {"name": "input_20", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_20"}, "inbound_nodes": []}, {"name": "input_13", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_13"}, "inbound_nodes": []}, {"name": "input_17", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_17"}, "inbound_nodes": []}, {"name": "dense_880", "class_name": "Dense", "config": {"name": "dense_880", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_12", 0, 0, {}]]]}, {"name": "dense_879", "class_name": "Dense", "config": {"name": "dense_879", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"name": "dense_883", "class_name": "Dense", "config": {"name": "dense_883", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_15", 0, 0, {}]]]}, {"name": "dense_884", "class_name": "Dense", "config": {"name": "dense_884", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_16", 0, 0, {}]]]}, {"name": "dense_882", "class_name": "Dense", "config": {"name": "dense_882", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_14", 0, 0, {}]]]}, {"name": "dense_887", "class_name": "Dense", "config": {"name": "dense_887", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_19", 0, 0, {}]]]}, {"name": "dense_886", "class_name": "Dense", "config": {"name": "dense_886", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_18", 0, 0, {}]]]}, {"name": "dense_888", "class_name": "Dense", "config": {"name": "dense_888", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"name": "dense_881", "class_name": "Dense", "config": {"name": "dense_881", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_13", 0, 0, {}]]]}, {"name": "dense_885", "class_name": "Dense", "config": {"name": "dense_885", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_17", 0, 0, {}]]]}, {"name": "concatenate_868", "class_name": "Concatenate", "config": {"name": "concatenate_868", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_880", 0, 0, {}], ["dense_879", 0, 0, {}]]]}, {"name": "concatenate_878", "class_name": "Concatenate", "config": {"name": "concatenate_878", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_882", 0, 0, {}], ["dense_883", 0, 0, {}]]]}, {"name": "concatenate_882", "class_name": "Concatenate", "config": {"name": "concatenate_882", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_879", 0, 0, {}], ["dense_886", 0, 0, {}]]]}, {"name": "concatenate_884", "class_name": "Concatenate", "config": {"name": "concatenate_884", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_884", 0, 0, {}], ["dense_884", 0, 0, {}]]]}, {"name": "concatenate_913", "class_name": "Concatenate", "config": {"name": "concatenate_913", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_888", 0, 0, {}], ["dense_886", 0, 0, {}]]]}, {"name": "concatenate_915", "class_name": "Concatenate", "config": {"name": "concatenate_915", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_888", 0, 0, {}], ["dense_884", 0, 0, {}]]]}, {"name": "concatenate_923", "class_name": "Concatenate", "config": {"name": "concatenate_923", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_883", 0, 0, {}], ["dense_884", 0, 0, {}]]]}, {"name": "concatenate_933", "class_name": "Concatenate", "config": {"name": "concatenate_933", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_880", 0, 0, {}], ["dense_880", 0, 0, {}]]]}, {"name": "concatenate_970", "class_name": "Concatenate", "config": {"name": "concatenate_970", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_879", 0, 0, {}], ["dense_880", 0, 0, {}]]]}, {"name": "concatenate_972", "class_name": "Concatenate", "config": {"name": "concatenate_972", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_881", 0, 0, {}], ["dense_879", 0, 0, {}]]]}, {"name": "concatenate_1005", "class_name": "Concatenate", "config": {"name": "concatenate_1005", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_882", 0, 0, {}], ["dense_883", 0, 0, {}]]]}, {"name": "concatenate_1007", "class_name": "Concatenate", "config": {"name": "concatenate_1007", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_879", 0, 0, {}], ["dense_884", 0, 0, {}]]]}, {"name": "concatenate_1011", "class_name": "Concatenate", "config": {"name": "concatenate_1011", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_883", 0, 0, {}], ["dense_886", 0, 0, {}]]]}, {"name": "concatenate_1013", "class_name": "Concatenate", "config": {"name": "concatenate_1013", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_879", 0, 0, {}], ["dense_882", 0, 0, {}]]]}, {"name": "concatenate_1020", "class_name": "Concatenate", "config": {"name": "concatenate_1020", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_879", 0, 0, {}], ["dense_884", 0, 0, {}]]]}, {"name": "concatenate_1024", "class_name": "Concatenate", "config": {"name": "concatenate_1024", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_880", 0, 0, {}], ["dense_879", 0, 0, {}]]]}, {"name": "concatenate_1026", "class_name": "Concatenate", "config": {"name": "concatenate_1026", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_879", 0, 0, {}], ["dense_882", 0, 0, {}]]]}, {"name": "concatenate_1036", "class_name": "Concatenate", "config": {"name": "concatenate_1036", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_882", 0, 0, {}], ["dense_883", 0, 0, {}]]]}, {"name": "concatenate_1056", "class_name": "Concatenate", "config": {"name": "concatenate_1056", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_886", 0, 0, {}], ["dense_879", 0, 0, {}]]]}, {"name": "concatenate_1078", "class_name": "Concatenate", "config": {"name": "concatenate_1078", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_888", 0, 0, {}], ["dense_884", 0, 0, {}]]]}, {"name": "concatenate_1080", "class_name": "Concatenate", "config": {"name": "concatenate_1080", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_884", 0, 0, {}], ["dense_880", 0, 0, {}]]]}, {"name": "concatenate_1089", "class_name": "Concatenate", "config": {"name": "concatenate_1089", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_883", 0, 0, {}], ["dense_879", 0, 0, {}]]]}, {"name": "concatenate_1091", "class_name": "Concatenate", "config": {"name": "concatenate_1091", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_882", 0, 0, {}], ["dense_882", 0, 0, {}]]]}, {"name": "concatenate_1095", "class_name": "Concatenate", "config": {"name": "concatenate_1095", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_884", 0, 0, {}], ["dense_879", 0, 0, {}]]]}, {"name": "concatenate_1104", "class_name": "Concatenate", "config": {"name": "concatenate_1104", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_883", 0, 0, {}], ["dense_879", 0, 0, {}]]]}, {"name": "concatenate_1106", "class_name": "Concatenate", "config": {"name": "concatenate_1106", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_880", 0, 0, {}], ["dense_884", 0, 0, {}]]]}, {"name": "concatenate_1111", "class_name": "Concatenate", "config": {"name": "concatenate_1111", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_879", 0, 0, {}], ["dense_886", 0, 0, {}]]]}, {"name": "concatenate_1149", "class_name": "Concatenate", "config": {"name": "concatenate_1149", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_883", 0, 0, {}], ["dense_883", 0, 0, {}]]]}, {"name": "concatenate_1151", "class_name": "Concatenate", "config": {"name": "concatenate_1151", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_882", 0, 0, {}], ["dense_886", 0, 0, {}]]]}, {"name": "concatenate_1172", "class_name": "Concatenate", "config": {"name": "concatenate_1172", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_879", 0, 0, {}], ["dense_883", 0, 0, {}]]]}, {"name": "concatenate_1194", "class_name": "Concatenate", "config": {"name": "concatenate_1194", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_884", 0, 0, {}], ["dense_883", 0, 0, {}]]]}, {"name": "concatenate_1198", "class_name": "Concatenate", "config": {"name": "concatenate_1198", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_883", 0, 0, {}], ["dense_883", 0, 0, {}]]]}, {"name": "concatenate_1200", "class_name": "Concatenate", "config": {"name": "concatenate_1200", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_883", 0, 0, {}], ["dense_882", 0, 0, {}]]]}, {"name": "concatenate_1224", "class_name": "Concatenate", "config": {"name": "concatenate_1224", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_879", 0, 0, {}], ["dense_879", 0, 0, {}]]]}, {"name": "concatenate_1226", "class_name": "Concatenate", "config": {"name": "concatenate_1226", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_880", 0, 0, {}], ["dense_882", 0, 0, {}]]]}, {"name": "concatenate_1247", "class_name": "Concatenate", "config": {"name": "concatenate_1247", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_887", 0, 0, {}], ["dense_882", 0, 0, {}]]]}, {"name": "concatenate_1267", "class_name": "Concatenate", "config": {"name": "concatenate_1267", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_884", 0, 0, {}], ["dense_879", 0, 0, {}]]]}, {"name": "concatenate_1276", "class_name": "Concatenate", "config": {"name": "concatenate_1276", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_883", 0, 0, {}], ["dense_879", 0, 0, {}]]]}, {"name": "concatenate_1282", "class_name": "Concatenate", "config": {"name": "concatenate_1282", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_883", 0, 0, {}], ["dense_880", 0, 0, {}]]]}, {"name": "concatenate_1296", "class_name": "Concatenate", "config": {"name": "concatenate_1296", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_882", 0, 0, {}], ["dense_879", 0, 0, {}]]]}, {"name": "concatenate_1310", "class_name": "Concatenate", "config": {"name": "concatenate_1310", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_879", 0, 0, {}], ["dense_883", 0, 0, {}]]]}, {"name": "concatenate_1315", "class_name": "Concatenate", "config": {"name": "concatenate_1315", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_879", 0, 0, {}], ["dense_882", 0, 0, {}]]]}, {"name": "concatenate_1317", "class_name": "Concatenate", "config": {"name": "concatenate_1317", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_883", 0, 0, {}], ["dense_884", 0, 0, {}]]]}, {"name": "concatenate_1332", "class_name": "Concatenate", "config": {"name": "concatenate_1332", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_884", 0, 0, {}], ["dense_880", 0, 0, {}]]]}, {"name": "concatenate_1360", "class_name": "Concatenate", "config": {"name": "concatenate_1360", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_880", 0, 0, {}], ["dense_880", 0, 0, {}]]]}, {"name": "concatenate_1369", "class_name": "Concatenate", "config": {"name": "concatenate_1369", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_888", 0, 0, {}], ["dense_882", 0, 0, {}]]]}, {"name": "concatenate_1371", "class_name": "Concatenate", "config": {"name": "concatenate_1371", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_882", 0, 0, {}], ["dense_886", 0, 0, {}]]]}, {"name": "concatenate_1396", "class_name": "Concatenate", "config": {"name": "concatenate_1396", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_887", 0, 0, {}], ["dense_885", 0, 0, {}]]]}, {"name": "dense_889", "class_name": "Dense", "config": {"name": "dense_889", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_868", 0, 0, {}]]]}, {"name": "dense_899", "class_name": "Dense", "config": {"name": "dense_899", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_878", 0, 0, {}]]]}, {"name": "dense_903", "class_name": "Dense", "config": {"name": "dense_903", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_882", 0, 0, {}]]]}, {"name": "dense_905", "class_name": "Dense", "config": {"name": "dense_905", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_884", 0, 0, {}]]]}, {"name": "dense_934", "class_name": "Dense", "config": {"name": "dense_934", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_913", 0, 0, {}]]]}, {"name": "dense_936", "class_name": "Dense", "config": {"name": "dense_936", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_915", 0, 0, {}]]]}, {"name": "dense_944", "class_name": "Dense", "config": {"name": "dense_944", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_923", 0, 0, {}]]]}, {"name": "dense_954", "class_name": "Dense", "config": {"name": "dense_954", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_933", 0, 0, {}]]]}, {"name": "dense_991", "class_name": "Dense", "config": {"name": "dense_991", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_970", 0, 0, {}]]]}, {"name": "dense_993", "class_name": "Dense", "config": {"name": "dense_993", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_972", 0, 0, {}]]]}, {"name": "dense_1026", "class_name": "Dense", "config": {"name": "dense_1026", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1005", 0, 0, {}]]]}, {"name": "dense_1028", "class_name": "Dense", "config": {"name": "dense_1028", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1007", 0, 0, {}]]]}, {"name": "dense_1032", "class_name": "Dense", "config": {"name": "dense_1032", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1011", 0, 0, {}]]]}, {"name": "dense_1034", "class_name": "Dense", "config": {"name": "dense_1034", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1013", 0, 0, {}]]]}, {"name": "dense_1041", "class_name": "Dense", "config": {"name": "dense_1041", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1020", 0, 0, {}]]]}, {"name": "dense_1045", "class_name": "Dense", "config": {"name": "dense_1045", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1024", 0, 0, {}]]]}, {"name": "dense_1047", "class_name": "Dense", "config": {"name": "dense_1047", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1026", 0, 0, {}]]]}, {"name": "dense_1057", "class_name": "Dense", "config": {"name": "dense_1057", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1036", 0, 0, {}]]]}, {"name": "dense_1077", "class_name": "Dense", "config": {"name": "dense_1077", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1056", 0, 0, {}]]]}, {"name": "dense_1099", "class_name": "Dense", "config": {"name": "dense_1099", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1078", 0, 0, {}]]]}, {"name": "dense_1101", "class_name": "Dense", "config": {"name": "dense_1101", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1080", 0, 0, {}]]]}, {"name": "dense_1110", "class_name": "Dense", "config": {"name": "dense_1110", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1089", 0, 0, {}]]]}, {"name": "dense_1112", "class_name": "Dense", "config": {"name": "dense_1112", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1091", 0, 0, {}]]]}, {"name": "dense_1116", "class_name": "Dense", "config": {"name": "dense_1116", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1095", 0, 0, {}]]]}, {"name": "dense_1125", "class_name": "Dense", "config": {"name": "dense_1125", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1104", 0, 0, {}]]]}, {"name": "dense_1127", "class_name": "Dense", "config": {"name": "dense_1127", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1106", 0, 0, {}]]]}, {"name": "dense_1132", "class_name": "Dense", "config": {"name": "dense_1132", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1111", 0, 0, {}]]]}, {"name": "dense_1170", "class_name": "Dense", "config": {"name": "dense_1170", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1149", 0, 0, {}]]]}, {"name": "dense_1172", "class_name": "Dense", "config": {"name": "dense_1172", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1151", 0, 0, {}]]]}, {"name": "dense_1193", "class_name": "Dense", "config": {"name": "dense_1193", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1172", 0, 0, {}]]]}, {"name": "dense_1215", "class_name": "Dense", "config": {"name": "dense_1215", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1194", 0, 0, {}]]]}, {"name": "dense_1219", "class_name": "Dense", "config": {"name": "dense_1219", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1198", 0, 0, {}]]]}, {"name": "dense_1221", "class_name": "Dense", "config": {"name": "dense_1221", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1200", 0, 0, {}]]]}, {"name": "dense_1245", "class_name": "Dense", "config": {"name": "dense_1245", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1224", 0, 0, {}]]]}, {"name": "dense_1247", "class_name": "Dense", "config": {"name": "dense_1247", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1226", 0, 0, {}]]]}, {"name": "dense_1268", "class_name": "Dense", "config": {"name": "dense_1268", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1247", 0, 0, {}]]]}, {"name": "dense_1288", "class_name": "Dense", "config": {"name": "dense_1288", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1267", 0, 0, {}]]]}, {"name": "dense_1297", "class_name": "Dense", "config": {"name": "dense_1297", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1276", 0, 0, {}]]]}, {"name": "dense_1303", "class_name": "Dense", "config": {"name": "dense_1303", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1282", 0, 0, {}]]]}, {"name": "dense_1317", "class_name": "Dense", "config": {"name": "dense_1317", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1296", 0, 0, {}]]]}, {"name": "dense_1331", "class_name": "Dense", "config": {"name": "dense_1331", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1310", 0, 0, {}]]]}, {"name": "dense_1336", "class_name": "Dense", "config": {"name": "dense_1336", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1315", 0, 0, {}]]]}, {"name": "dense_1338", "class_name": "Dense", "config": {"name": "dense_1338", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1317", 0, 0, {}]]]}, {"name": "dense_1353", "class_name": "Dense", "config": {"name": "dense_1353", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1332", 0, 0, {}]]]}, {"name": "dense_1381", "class_name": "Dense", "config": {"name": "dense_1381", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1360", 0, 0, {}]]]}, {"name": "dense_1390", "class_name": "Dense", "config": {"name": "dense_1390", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1369", 0, 0, {}]]]}, {"name": "dense_1392", "class_name": "Dense", "config": {"name": "dense_1392", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1371", 0, 0, {}]]]}, {"name": "dense_1417", "class_name": "Dense", "config": {"name": "dense_1417", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1396", 0, 0, {}]]]}, {"name": "concatenate_869", "class_name": "Concatenate", "config": {"name": "concatenate_869", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_889", 0, 0, {}], ["dense_879", 0, 0, {}]]]}, {"name": "concatenate_872", "class_name": "Concatenate", "config": {"name": "concatenate_872", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_884", 0, 0, {}], ["dense_882", 0, 0, {}]]]}, {"name": "concatenate_877", "class_name": "Concatenate", "config": {"name": "concatenate_877", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_879", 0, 0, {}], ["dense_887", 0, 0, {}]]]}, {"name": "concatenate_879", "class_name": "Concatenate", "config": {"name": "concatenate_879", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_899", 0, 0, {}], ["dense_886", 0, 0, {}]]]}, {"name": "concatenate_883", "class_name": "Concatenate", "config": {"name": "concatenate_883", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_903", 0, 0, {}], ["dense_882", 0, 0, {}]]]}, {"name": "concatenate_885", "class_name": "Concatenate", "config": {"name": "concatenate_885", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_905", 0, 0, {}], ["dense_880", 0, 0, {}]]]}, {"name": "concatenate_892", "class_name": "Concatenate", "config": {"name": "concatenate_892", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_882", 0, 0, {}], ["dense_880", 0, 0, {}]]]}, {"name": "concatenate_895", "class_name": "Concatenate", "config": {"name": "concatenate_895", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_880", 0, 0, {}], ["dense_884", 0, 0, {}]]]}, {"name": "concatenate_900", "class_name": "Concatenate", "config": {"name": "concatenate_900", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_879", 0, 0, {}], ["dense_880", 0, 0, {}]]]}, {"name": "concatenate_903", "class_name": "Concatenate", "config": {"name": "concatenate_903", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_884", 0, 0, {}], ["dense_883", 0, 0, {}]]]}, {"name": "concatenate_904", "class_name": "Concatenate", "config": {"name": "concatenate_904", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_880", 0, 0, {}], ["dense_887", 0, 0, {}]]]}, {"name": "concatenate_914", "class_name": "Concatenate", "config": {"name": "concatenate_914", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_934", 0, 0, {}], ["dense_882", 0, 0, {}]]]}, {"name": "concatenate_916", "class_name": "Concatenate", "config": {"name": "concatenate_916", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_936", 0, 0, {}], ["dense_879", 0, 0, {}]]]}, {"name": "concatenate_924", "class_name": "Concatenate", "config": {"name": "concatenate_924", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_944", 0, 0, {}], ["dense_883", 0, 0, {}]]]}, {"name": "concatenate_925", "class_name": "Concatenate", "config": {"name": "concatenate_925", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_882", 0, 0, {}], ["dense_883", 0, 0, {}]]]}, {"name": "concatenate_932", "class_name": "Concatenate", "config": {"name": "concatenate_932", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_882", 0, 0, {}], ["dense_887", 0, 0, {}]]]}, {"name": "concatenate_934", "class_name": "Concatenate", "config": {"name": "concatenate_934", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_954", 0, 0, {}], ["dense_882", 0, 0, {}]]]}, {"name": "concatenate_937", "class_name": "Concatenate", "config": {"name": "concatenate_937", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_884", 0, 0, {}], ["dense_887", 0, 0, {}]]]}, {"name": "concatenate_938", "class_name": "Concatenate", "config": {"name": "concatenate_938", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_882", 0, 0, {}], ["dense_884", 0, 0, {}]]]}, {"name": "concatenate_950", "class_name": "Concatenate", "config": {"name": "concatenate_950", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_888", 0, 0, {}], ["dense_880", 0, 0, {}]]]}, {"name": "concatenate_971", "class_name": "Concatenate", "config": {"name": "concatenate_971", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_991", 0, 0, {}], ["dense_879", 0, 0, {}]]]}, {"name": "concatenate_973", "class_name": "Concatenate", "config": {"name": "concatenate_973", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_993", 0, 0, {}], ["dense_884", 0, 0, {}]]]}, {"name": "concatenate_982", "class_name": "Concatenate", "config": {"name": "concatenate_982", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_879",