{"class_name": "Model", "config": {"name": "model_5", "layers": [{"name": "input_28", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_28"}, "inbound_nodes": []}, {"name": "input_31", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_31"}, "inbound_nodes": []}, {"name": "input_25", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_25"}, "inbound_nodes": []}, {"name": "dense_504", "class_name": "Dense", "config": {"name": "dense_504", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_28", 0, 0, {}]]]}, {"name": "dense_507", "class_name": "Dense", "config": {"name": "dense_507", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_31", 0, 0, {}]]]}, {"name": "dense_501", "class_name": "Dense", "config": {"name": "dense_501", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_25", 0, 0, {}]]]}, {"name": "concatenate_481", "class_name": "Concatenate", "config": {"name": "concatenate_481", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_504", 0, 0, {}], ["dense_507", 0, 0, {}]]]}, {"name": "concatenate_482", "class_name": "Concatenate", "config": {"name": "concatenate_482", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_501", 0, 0, {}], ["dense_507", 0, 0, {}]]]}, {"name": "dense_517", "class_name": "Dense", "config": {"name": "dense_517", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_481", 0, 0, {}]]]}, {"name": "dense_518", "class_name": "Dense", "config": {"name": "dense_518", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_482", 0, 0, {}]]]}, {"name": "input_29", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_29"}, "inbound_nodes": []}, {"name": "concatenate_483", "class_name": "Concatenate", "config": {"name": "concatenate_483", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_517", 0, 0, {}], ["dense_518", 0, 0, {}]]]}, {"name": "dense_505", "class_name": "Dense", "config": {"name": "dense_505", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_29", 0, 0, {}]]]}, {"name": "dense_519", "class_name": "Dense", "config": {"name": "dense_519", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_483", 0, 0, {}]]]}, {"name": "concatenate_484", "class_name": "Concatenate", "config": {"name": "concatenate_484", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_519", 0, 0, {}], ["dense_505", 0, 0, {}]]]}, {"name": "concatenate_486", "class_name": "Concatenate", "config": {"name": "concatenate_486", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_507", 0, 0, {}], ["dense_507", 0, 0, {}]]]}, {"name": "dense_520", "class_name": "Dense", "config": {"name": "dense_520", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_484", 0, 0, {}]]]}, {"name": "dense_522", "class_name": "Dense", "config": {"name": "dense_522", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_486", 0, 0, {}]]]}, {"name": "input_24", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_24"}, "inbound_nodes": []}, {"name": "concatenate_485", "class_name": "Concatenate", "config": {"name": "concatenate_485", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_520", 0, 0, {}], ["dense_507", 0, 0, {}]]]}, {"name": "concatenate_487", "class_name": "Concatenate", "config": {"name": "concatenate_487", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_507", 0, 0, {}], ["dense_522", 0, 0, {}]]]}, {"name": "dense_500", "class_name": "Dense", "config": {"name": "dense_500", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_24", 0, 0, {}]]]}, {"name": "dense_521", "class_name": "Dense", "config": {"name": "dense_521", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_485", 0, 0, {}]]]}, {"name": "dense_523", "class_name": "Dense", "config": {"name": "dense_523", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_487", 0, 0, {}]]]}, {"name": "concatenate_488", "class_name": "Concatenate", "config": {"name": "concatenate_488", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_521", 0, 0, {}], ["dense_523", 0, 0, {}]]]}, {"name": "concatenate_493", "class_name": "Concatenate", "config": {"name": "concatenate_493", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_507", 0, 0, {}], ["dense_500", 0, 0, {}]]]}, {"name": "dense_524", "class_name": "Dense", "config": {"name": "dense_524", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_488", 0, 0, {}]]]}, {"name": "dense_529", "class_name": "Dense", "config": {"name": "dense_529", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_493", 0, 0, {}]]]}, {"name": "concatenate_480", "class_name": "Concatenate", "config": {"name": "concatenate_480", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_507", 0, 0, {}], ["dense_507", 0, 0, {}]]]}, {"name": "concatenate_489", "class_name": "Concatenate", "config": {"name": "concatenate_489", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_524", 0, 0, {}], ["dense_500", 0, 0, {}]]]}, {"name": "concatenate_492", "class_name": "Concatenate", "config": {"name": "concatenate_492", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_507", 0, 0, {}], ["dense_507", 0, 0, {}]]]}, {"name": "concatenate_494", "class_name": "Concatenate", "config": {"name": "concatenate_494", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_529", 0, 0, {}], ["dense_507", 0, 0, {}]]]}, {"name": "dense_516", "class_name": "Dense", "config": {"name": "dense_516", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_480", 0, 0, {}]]]}, {"name": "dense_525", "class_name": "Dense", "config": {"name": "dense_525", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_489", 0, 0, {}]]]}, {"name": "dense_528", "class_name": "Dense", "config": {"name": "dense_528", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_492", 0, 0, {}]]]}, {"name": "dense_530", "class_name": "Dense", "config": {"name": "dense_530", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_494", 0, 0, {}]]]}, {"name": "concatenate_473", "class_name": "Concatenate", "config": {"name": "concatenate_473", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_505", 0, 0, {}], ["dense_504", 0, 0, {}]]]}, {"name": "concatenate_490", "class_name": "Concatenate", "config": {"name": "concatenate_490", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_516", 0, 0, {}], ["dense_525", 0, 0, {}]]]}, {"name": "concatenate_495", "class_name": "Concatenate", "config": {"name": "concatenate_495", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_528", 0, 0, {}], ["dense_530", 0, 0, {}]]]}, {"name": "input_27", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_27"}, "inbound_nodes": []}, {"name": "dense_509", "class_name": "Dense", "config": {"name": "dense_509", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_473", 0, 0, {}]]]}, {"name": "dense_526", "class_name": "Dense", "config": {"name": "dense_526", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_490", 0, 0, {}]]]}, {"name": "dense_531", "class_name": "Dense", "config": {"name": "dense_531", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_495", 0, 0, {}]]]}, {"name": "dense_503", "class_name": "Dense", "config": {"name": "dense_503", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_27", 0, 0, {}]]]}, {"name": "concatenate_474", "class_name": "Concatenate", "config": {"name": "concatenate_474", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_509", 0, 0, {}], ["dense_507", 0, 0, {}]]]}, {"name": "input_30", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_30"}, "inbound_nodes": []}, {"name": "concatenate_491", "class_name": "Concatenate", "config": {"name": "concatenate_491", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_526", 0, 0, {}], ["dense_505", 0, 0, {}]]]}, {"name": "concatenate_496", "class_name": "Concatenate", "config": {"name": "concatenate_496", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_531", 0, 0, {}], ["dense_503", 0, 0, {}]]]}, {"name": "dense_510", "class_name": "Dense", "config": {"name": "dense_510", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_474", 0, 0, {}]]]}, {"name": "dense_506", "class_name": "Dense", "config": {"name": "dense_506", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_30", 0, 0, {}]]]}, {"name": "dense_527", "class_name": "Dense", "config": {"name": "dense_527", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_491", 0, 0, {}]]]}, {"name": "dense_532", "class_name": "Dense", "config": {"name": "dense_532", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_496", 0, 0, {}]]]}, {"name": "concatenate_475", "class_name": "Concatenate", "config": {"name": "concatenate_475", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_510", 0, 0, {}], ["dense_506", 0, 0, {}]]]}, {"name": "concatenate_497", "class_name": "Concatenate", "config": {"name": "concatenate_497", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_527", 0, 0, {}], ["dense_532", 0, 0, {}]]]}, {"name": "dense_511", "class_name": "Dense", "config": {"name": "dense_511", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_475", 0, 0, {}]]]}, {"name": "dense_533", "class_name": "Dense", "config": {"name": "dense_533", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_497", 0, 0, {}]]]}, {"name": "concatenate_476", "class_name": "Concatenate", "config": {"name": "concatenate_476", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_511", 0, 0, {}], ["dense_500", 0, 0, {}]]]}, {"name": "concatenate_479", "class_name": "Concatenate", "config": {"name": "concatenate_479", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_506", 0, 0, {}], ["dense_507", 0, 0, {}]]]}, {"name": "concatenate_498", "class_name": "Concatenate", "config": {"name": "concatenate_498", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_533", 0, 0, {}], ["dense_501", 0, 0, {}]]]}, {"name": "dense_512", "class_name": "Dense", "config": {"name": "dense_512", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_476", 0, 0, {}]]]}, {"name": "dense_515", "class_name": "Dense", "config": {"name": "dense_515", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_479", 0, 0, {}]]]}, {"name": "dense_534", "class_name": "Dense", "config": {"name": "dense_534", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_498", 0, 0, {}]]]}, {"name": "concatenate_477", "class_name": "Concatenate", "config": {"name": "concatenate_477", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_512", 0, 0, {}], ["dense_500", 0, 0, {}]]]}, {"name": "concatenate_499", "class_name": "Concatenate", "config": {"name": "concatenate_499", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_515", 0, 0, {}], ["dense_534", 0, 0, {}]]]}, {"name": "input_26", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_26"}, "inbound_nodes": []}, {"name": "dense_513", "class_name": "Dense", "config": {"name": "dense_513", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_477", 0, 0, {}]]]}, {"name": "dense_535", "class_name": "Dense", "config": {"name": "dense_535", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_499", 0, 0, {}]]]}, {"name": "dense_502", "class_name": "Dense", "config": {"name": "dense_502", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_26", 0, 0, {}]]]}, {"name": "concatenate_478", "class_name": "Concatenate", "config": {"name": "concatenate_478", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_513", 0, 0, {}], ["dense_505", 0, 0, {}]]]}, {"name": "concatenate_500", "class_name": "Concatenate", "config": {"name": "concatenate_500", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_535", 0, 0, {}], ["dense_502", 0, 0, {}]]]}, {"name": "dense_514", "class_name": "Dense", "config": {"name": "dense_514", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_478", 0, 0, {}]]]}, {"name": "dense_536", "class_name": "Dense", "config": {"name": "dense_536", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_500", 0, 0, {}]]]}, {"name": "concatenate_501", "class_name": "Concatenate", "config": {"name": "concatenate_501", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_514", 0, 0, {}], ["dense_536", 0, 0, {}]]]}, {"name": "dense_537", "class_name": "Dense", "config": {"name": "dense_537", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_501", 0, 0, {}]]]}, {"name": "concatenate_502", "class_name": "Concatenate", "config": {"name": "concatenate_502", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_537", 0, 0, {}], ["dense_501", 0, 0, {}]]]}, {"name": "dense_538", "class_name": "Dense", "config": {"name": "dense_538", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_502", 0, 0, {}]]]}, {"name": "dense_539", "class_name": "Dense", "config": {"name": "dense_539", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_538", 0, 0, {}]]]}], "input_layers": [["input_24", 0, 0], ["input_25", 0, 0], ["input_26", 0, 0], ["input_27", 0, 0], ["input_28", 0, 0], ["input_29", 0, 0], ["input_30", 0, 0], ["input_31", 0, 0]], "output_layers": [["dense_539", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}