{"class_name": "Model", "config": {"name": "model_6", "layers": [{"name": "input_39", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_39"}, "inbound_nodes": []}, {"name": "input_40", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_40"}, "inbound_nodes": []}, {"name": "dense_546", "class_name": "Dense", "config": {"name": "dense_546", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_39", 0, 0, {}]]]}, {"name": "dense_547", "class_name": "Dense", "config": {"name": "dense_547", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_40", 0, 0, {}]]]}, {"name": "concatenate_545", "class_name": "Concatenate", "config": {"name": "concatenate_545", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_546", 0, 0, {}], ["dense_547", 0, 0, {}]]]}, {"name": "dense_590", "class_name": "Dense", "config": {"name": "dense_590", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_545", 0, 0, {}]]]}, {"name": "input_34", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_34"}, "inbound_nodes": []}, {"name": "concatenate_546", "class_name": "Concatenate", "config": {"name": "concatenate_546", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_546", 0, 0, {}], ["dense_590", 0, 0, {}]]]}, {"name": "dense_541", "class_name": "Dense", "config": {"name": "dense_541", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_34", 0, 0, {}]]]}, {"name": "dense_591", "class_name": "Dense", "config": {"name": "dense_591", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_546", 0, 0, {}]]]}, {"name": "input_33", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_33"}, "inbound_nodes": []}, {"name": "concatenate_547", "class_name": "Concatenate", "config": {"name": "concatenate_547", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_591", 0, 0, {}], ["dense_541", 0, 0, {}]]]}, {"name": "dense_540", "class_name": "Dense", "config": {"name": "dense_540", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_33", 0, 0, {}]]]}, {"name": "dense_592", "class_name": "Dense", "config": {"name": "dense_592", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_547", 0, 0, {}]]]}, {"name": "concatenate_548", "class_name": "Concatenate", "config": {"name": "concatenate_548", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_592", 0, 0, {}], ["dense_546", 0, 0, {}]]]}, {"name": "concatenate_549", "class_name": "Concatenate", "config": {"name": "concatenate_549", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_540", 0, 0, {}], ["dense_546", 0, 0, {}]]]}, {"name": "dense_593", "class_name": "Dense", "config": {"name": "dense_593", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_548", 0, 0, {}]]]}, {"name": "dense_594", "class_name": "Dense", "config": {"name": "dense_594", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_549", 0, 0, {}]]]}, {"name": "input_38", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_38"}, "inbound_nodes": []}, {"name": "input_35", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_35"}, "inbound_nodes": []}, {"name": "input_37", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_37"}, "inbound_nodes": []}, {"name": "concatenate_550", "class_name": "Concatenate", "config": {"name": "concatenate_550", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_593", 0, 0, {}], ["dense_594", 0, 0, {}]]]}, {"name": "concatenate_587", "class_name": "Concatenate", "config": {"name": "concatenate_587", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_546", 0, 0, {}], ["dense_546", 0, 0, {}]]]}, {"name": "dense_545", "class_name": "Dense", "config": {"name": "dense_545", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_38", 0, 0, {}]]]}, {"name": "dense_542", "class_name": "Dense", "config": {"name": "dense_542", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_35", 0, 0, {}]]]}, {"name": "dense_544", "class_name": "Dense", "config": {"name": "dense_544", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_37", 0, 0, {}]]]}, {"name": "dense_595", "class_name": "Dense", "config": {"name": "dense_595", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_550", 0, 0, {}]]]}, {"name": "dense_632", "class_name": "Dense", "config": {"name": "dense_632", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_587", 0, 0, {}]]]}, {"name": "concatenate_512", "class_name": "Concatenate", "config": {"name": "concatenate_512", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_544", 0, 0, {}], ["dense_544", 0, 0, {}]]]}, {"name": "concatenate_538", "class_name": "Concatenate", "config": {"name": "concatenate_538", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_542", 0, 0, {}], ["dense_546", 0, 0, {}]]]}, {"name": "concatenate_544", "class_name": "Concatenate", "config": {"name": "concatenate_544", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_546", 0, 0, {}], ["dense_545", 0, 0, {}]]]}, {"name": "concatenate_551", "class_name": "Concatenate", "config": {"name": "concatenate_551", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_595", 0, 0, {}], ["dense_545", 0, 0, {}]]]}, {"name": "concatenate_588", "class_name": "Concatenate", "config": {"name": "concatenate_588", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_632", 0, 0, {}], ["dense_542", 0, 0, {}]]]}, {"name": "concatenate_598", "class_name": "Concatenate", "config": {"name": "concatenate_598", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_547", 0, 0, {}], ["dense_547", 0, 0, {}]]]}, {"name": "dense_557", "class_name": "Dense", "config": {"name": "dense_557", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_512", 0, 0, {}]]]}, {"name": "dense_583", "class_name": "Dense", "config": {"name": "dense_583", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_538", 0, 0, {}]]]}, {"name": "dense_589", "class_name": "Dense", "config": {"name": "dense_589", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_544", 0, 0, {}]]]}, {"name": "dense_596", "class_name": "Dense", "config": {"name": "dense_596", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_551", 0, 0, {}]]]}, {"name": "dense_633", "class_name": "Dense", "config": {"name": "dense_633", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_588", 0, 0, {}]]]}, {"name": "dense_643", "class_name": "Dense", "config": {"name": "dense_643", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_598", 0, 0, {}]]]}, {"name": "input_36", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_36"}, "inbound_nodes": []}, {"name": "concatenate_506", "class_name": "Concatenate", "config": {"name": "concatenate_506", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_541", 0, 0, {}], ["dense_541", 0, 0, {}]]]}, {"name": "concatenate_513", "class_name": "Concatenate", "config": {"name": "concatenate_513", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_545", 0, 0, {}], ["dense_557", 0, 0, {}]]]}, {"name": "concatenate_539", "class_name": "Concatenate", "config": {"name": "concatenate_539", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_583", 0, 0, {}], ["dense_541", 0, 0, {}]]]}, {"name": "concatenate_552", "class_name": "Concatenate", "config": {"name": "concatenate_552", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_589", 0, 0, {}], ["dense_596", 0, 0, {}]]]}, {"name": "concatenate_589", "class_name": "Concatenate", "config": {"name": "concatenate_589", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_633", 0, 0, {}], ["dense_547", 0, 0, {}]]]}, {"name": "concatenate_599", "class_name": "Concatenate", "config": {"name": "concatenate_599", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_643", 0, 0, {}], ["dense_544", 0, 0, {}]]]}, {"name": "dense_543", "class_name": "Dense", "config": {"name": "dense_543", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_36", 0, 0, {}]]]}, {"name": "dense_551", "class_name": "Dense", "config": {"name": "dense_551", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_506", 0, 0, {}]]]}, {"name": "dense_558", "class_name": "Dense", "config": {"name": "dense_558", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_513", 0, 0, {}]]]}, {"name": "dense_584", "class_name": "Dense", "config": {"name": "dense_584", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_539", 0, 0, {}]]]}, {"name": "dense_597", "class_name": "Dense", "config": {"name": "dense_597", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_552", 0, 0, {}]]]}, {"name": "dense_634", "class_name": "Dense", "config": {"name": "dense_634", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_589", 0, 0, {}]]]}, {"name": "dense_644", "class_name": "Dense", "config": {"name": "dense_644", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_599", 0, 0, {}]]]}, {"name": "concatenate_507", "class_name": "Concatenate", "config": {"name": "concatenate_507", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_551", 0, 0, {}], ["dense_546", 0, 0, {}]]]}, {"name": "concatenate_514", "class_name": "Concatenate", "config": {"name": "concatenate_514", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_558", 0, 0, {}], ["dense_546", 0, 0, {}]]]}, {"name": "concatenate_517", "class_name": "Concatenate", "config": {"name": "concatenate_517", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_541", 0, 0, {}], ["dense_542", 0, 0, {}]]]}, {"name": "concatenate_529", "class_name": "Concatenate", "config": {"name": "concatenate_529", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_541", 0, 0, {}], ["dense_546", 0, 0, {}]]]}, {"name": "concatenate_540", "class_name": "Concatenate", "config": {"name": "concatenate_540", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_584", 0, 0, {}], ["dense_541", 0, 0, {}]]]}, {"name": "concatenate_543", "class_name": "Concatenate", "config": {"name": "concatenate_543", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_545", 0, 0, {}], ["dense_546", 0, 0, {}]]]}, {"name": "concatenate_553", "class_name": "Concatenate", "config": {"name": "concatenate_553", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_597", 0, 0, {}], ["dense_542", 0, 0, {}]]]}, {"name": "concatenate_590", "class_name": "Concatenate", "config": {"name": "concatenate_590", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_634", 0, 0, {}], ["dense_546", 0, 0, {}]]]}, {"name": "concatenate_600", "class_name": "Concatenate", "config": {"name": "concatenate_600", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_644", 0, 0, {}], ["dense_543", 0, 0, {}]]]}, {"name": "concatenate_612", "class_name": "Concatenate", "config": {"name": "concatenate_612", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_545", 0, 0, {}], ["dense_546", 0, 0, {}]]]}, {"name": "dense_552", "class_name": "Dense", "config": {"name": "dense_552", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_507", 0, 0, {}]]]}, {"name": "dense_559", "class_name": "Dense", "config": {"name": "dense_559", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_514", 0, 0, {}]]]}, {"name": "dense_562", "class_name": "Dense", "config": {"name": "dense_562", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_517", 0, 0, {}]]]}, {"name": "dense_574", "class_name": "Dense", "config": {"name": "dense_574", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_529", 0, 0, {}]]]}, {"name": "dense_585", "class_name": "Dense", "config": {"name": "dense_585", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_540", 0, 0, {}]]]}, {"name": "dense_588", "class_name": "Dense", "config": {"name": "dense_588", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_543", 0, 0, {}]]]}, {"name": "dense_598", "class_name": "Dense", "config": {"name": "dense_598", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_553", 0, 0, {}]]]}, {"name": "dense_635", "class_name": "Dense", "config": {"name": "dense_635", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_590", 0, 0, {}]]]}, {"name": "dense_645", "class_name": "Dense", "config": {"name": "dense_645", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_600", 0, 0, {}]]]}, {"name": "dense_657", "class_name": "Dense", "config": {"name": "dense_657", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_612", 0, 0, {}]]]}, {"name": "concatenate_508", "class_name": "Concatenate", "config": {"name": "concatenate_508", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_552", 0, 0, {}], ["dense_546", 0, 0, {}]]]}, {"name": "concatenate_515", "class_name": "Concatenate", "config": {"name": "concatenate_515", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_559", 0, 0, {}], ["dense_541", 0, 0, {}]]]}, {"name": "concatenate_518", "class_name": "Concatenate", "config": {"name": "concatenate_518", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_562", 0, 0, {}], ["dense_546", 0, 0, {}]]]}, {"name": "concatenate_528", "class_name": "Concatenate", "config": {"name": "concatenate_528", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_546", 0, 0, {}], ["dense_546", 0, 0, {}]]]}, {"name": "concatenate_530", "class_name": "Concatenate", "config": {"name": "concatenate_530", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_545", 0, 0, {}], ["dense_574", 0, 0, {}]]]}, {"name": "concatenate_541", "class_name": "Concatenate", "config": {"name": "concatenate_541", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_585", 0, 0, {}], ["dense_546", 0, 0, {}]]]}, {"name": "concatenate_554", "class_name": "Concatenate", "config": {"name": "concatenate_554", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_588", 0, 0, {}], ["dense_598", 0, 0, {}]]]}, {"name": "concatenate_558", "class_name": "Concatenate", "config": {"name": "concatenate_558", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_547", 0, 0, {}], ["dense_545", 0, 0, {}]]]}, {"name": "concatenate_559", "class_name": "Concatenate", "config": {"name": "concatenate_559", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_544", 0, 0, {}], ["dense_546", 0, 0, {}]]]}, {"name": "concatenate_591", "class_name": "Concatenate", "config": {"name": "concatenate_591", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_635", 0, 0, {}], ["dense_545", 0, 0, {}]]]}, {"name": "concatenate_601", "class_name": "Concatenate", "config": {"name": "concatenate_601", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_545", 0, 0, {}], ["dense_645", 0, 0, {}]]]}, {"name": "concatenate_613", "class_name": "Concatenate", "config": {"name": "concatenate_613", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_547", 0, 0, {}], ["dense_657", 0, 0, {}]]]}, {"name": "concatenate_614", "class_name": "Concatenate", "config": {"name": "concatenate_614", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_547", 0, 0, {}], ["dense_547", 0, 0, {}]]]}, {"name": "dense_553", "class_name": "Dense", "config": {"name": "dense_553", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_508", 0, 0, {}]]]}, {"name": "dense_560", "class_name": "Dense", "config": {"name": "dense_560", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_515", 0, 0, {}]]]}, {"name": "dense_563", "class_name": "Dense", "config": {"name": "dense_563", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_518", 0, 0, {}]]]}, {"name": "dense_573", "class_name": "Dense", "config": {"name": "dense_573", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_528", 0, 0, {}]]]}, {"name": "dense_575", "class_name": "Dense", "config": {"name": "dense_575", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_530", 0, 0, {}]]]}, {"name": "dense_586", "class_name": "Dense", "config": {"name": "dense_586", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_541", 0, 0, {}]]]}, {"name": "dense_599", "class_name": "Dense", "config": {"name": "dense_599", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_554", 0, 0, {}]]]}, {"name": "dense_603", "class_name": "Dense", "config": {"name": "dense_603", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_558", 0, 0, {}]]]}, {"name": "dense_604", "class_name": "Dense", "config": {"name": "dense_604", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_559", 0, 0, {}]]]}, {"name": "dense_636", "class_name": "Dense", "config": {"name": "dense_636", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_591", 0, 0, {}]]]}, {"name": "dense_646", "class_name": "Dense", "config": {"name": "dense_646", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_601", 0, 0, {}]]]}, {"name": "dense_658", "class_name": "Dense", "config": {"name": "dense_658", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_613", 0, 0, {}]]]}, {"name": "dense_659", "class_name": "Dense", "config": {"name": "dense_659", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_614", 0, 0, {}]]]}, {"name": "concatenate_505", "class_name": "Concatenate", "config": {"name": "concatenate_505", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_545", 0, 0, {}], ["dense_543", 0, 0, {}]]]}, {"name": "concatenate_509", "class_name": "Concatenate", "config": {"name": "concatenate_509", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_553", 0, 0, {}], ["dense_546", 0, 0, {}]]]}, {"name": "concatenate_516", "class_name": "Concatenate", "config": {"name": "concatenate_516", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_541", 0, 0, {}], ["dense_560", 0, 0, {}]]]}, {"name": "concatenate_519", "class_name": "Concatenate", "config": {"name": "concatenate_519", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_541", 0, 0, {}], ["dense_563", 0, 0, {}]]]}, {"name": "concatenate_531", "class_name": "Concatenate", "config": {"name": "concatenate_531", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_573", 0, 0, {}], ["dense_575", 0, 0, {}]]]}, {"name": "concatenate_533", "class_name": "Concatenate", "config": {"name": "concatenate_533", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_546", 0, 0, {}], ["dense_546", 0, 0, {}]]]}, {"name": "concatenate_542", "class_name": "Concatenate", "config": {"name": "concatenate_542", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_545", 0, 0, {}], ["dense_586", 0, 0, {}]]]}, {"name": "concatenate_555", "class_name": "Concatenate", "config": {"name": "concatenate_555", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_599", 0, 0, {}], ["dense_540", 0, 0, {}]]]}, {"name": "concatenate_560", "class_name": "Concatenate", "config": {"name": "concatenate_560", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_603", 0, 0, {}], ["dense_604", 0, 0, {}]]]}, {"name": "concatenate_571", "class_name": "Concatenate", "config": {"name": "concatenate_571", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_541", 0, 0, {}], ["dense_541", 0, 0, {}]]]}, {"name": "concatenate_592", "class_name": "Concatenate", "config": {"name": "concatenate_592", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_636", 0, 0, {}], ["dense_540", 0, 0, {}]]]}, {"name": "concatenate_602", "class_name": "Concatenate", "config": {"name": "concatenate_602", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_545", 0, 0, {}], ["dense_646", 0, 0, {}]]]}, {"name": "concatenate_605", "class_name": "Concatenate", "config": {"name": "concatenate_605", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_545", 0, 0, {}], ["dense_545", 0, 0, {}]]]}, {"name": "concatenate_615", "class_name": "Concatenate", "config": {"name": "concatenate_615", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_658", 0, 0, {}], ["dense_659", 0, 0, {}]]]}, {"name": "concatenate_618", "class_name": "Concatenate", "config": {"name": "concatenate_618", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_547", 0, 0, {}], ["dense_540", 0, 0, {}]]]}, {"name": "dense_550", "class_name": "Dense", "config": {"name": "dense_550", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_505", 0, 0, {}]]]}, {"name": "dense_554", "class_name": "Dense", "config": {"name": "dense_554", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_509", 0, 0, {}]]]}, {"name": "dense_561", "class_name": "Dense", "config": {"name": "dense_561", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_516", 0, 0, {}]]]}, {"name": "dense_564", "class_name": "Dense", "config": {"name": "dense_564", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_519", 0, 0, {}]]]}, {"name": "dense_576", "class_name": "Dense", "config": {"name": "dense_576", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_531", 0, 0, {}]]]}, {"name": "dense_578", "class_name": "Dense", "config": {"name": "dense_578", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_533", 0, 0, {}]]]}, {"name": "dense_587", "class_name": "Dense", "config": {"name": "dense_587", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_542", 0, 0, {}]]]}, {"name": "dense_600", "class_name": "Dense", "config": {"name": "dense_600", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_555", 0, 0, {}]]]}, {"name": "dense_605", "class_name": "Dense", "config": {"name": "dense_605", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_560", 0, 0, {}]]]}, {"name": "dense_616", "class_name": "Dense", "config": {"name": "dense_616", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_571", 0, 0, {}]]]}, {"name": "dense_637", "class_name": "Dense", "config": {"name": "dense_637", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_592", 0, 0, {}]]]}, {"name": "dense_647", "class_name": "Dense", "config": {"name": "dense_647", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_602", 0, 0, {}]]]}, {"name": "dense_650", "class_name": "Dense", "config": {"name": "dense_650", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_605", 0, 0, {}]]]}, {"name": "dense_660", "class_name": "Dense", "config": {"name": "dense_660", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_615", 0, 0, {}]]]}, {"name": "dense_663", "class_name": "Dense", "config": {"name": "dense_663", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, 